{"id": "1150oa", "url": [{"path": "/photos/1150oa1.png", "type": "image", "imageAlt": "An old sepia photograph of three protesters standing outside the Viscount Hotel with a sign that says “I am a humansexual”"}, {"path": "/photos/1150oa2.png", "type": "image", "imageAlt": "An old photo of a smiling woman sitting on a smiling man's lap"}, {"path": "/photos/1550oa3.jpeg", "type": "image", "imageAlt": "A black and white photo of Frances Jefferson smiling to the left of the camera"}], "description": ["In 1979, Jim Davies and Harold Desmarais were fired from the Viscount Hotel for being Gay. Soon after, the first local gay discrimination protest happened outside the hotel. It was organized by members of Windsor Gay Unity.", "In 1982, the first reported case of AIDS in Canada was in Windsor at the Hotel Dieu Hospital. He was a 43-year-old gay man.", "In October 1953, Marie Francis Jefferson received the first recorded gender-affirming surgery performed in Windsor. Marie, who publicly called herself ”Canada's Christine Jorgenson”, was operated on by Dr. Walter L. Percival. Jefferson was in the hospital for over a month recovering, and when she was well enough for the first time, she walked along Ouellette Avenue in women's clothes. She thought everyone was looking at her “but I felt I was doing the right thing.” After the operation, she was put on hormone therapy. When she reflected on her journey, she said “I think the operation I had done in Windsor, that finally made me a woman.”  When she got out of the hospital, her parents went to see her and they walked right past her because they didn't recognize her.", "Jefferson was born on July 30th, 1929, in Bridgetown, Nova Scotia. Her experience, based on today's standards, would have classified her identity as intersex. Jefferson was “born with both male and female characteristics.” At birth, her mother had twelve doctors called in to decide on her sex and advised her mother to bring Marie up as a boy. But Jackson never felt at home in herself and started to develop breasts during puberty. The doctors at the time decided to operate on her and removed them. She greatly regretted that decision later in life."], "timeline": null, "image": "/photos/1150oa1.png"}