{"id": "1280oa", "url": null, "description": ["From 1982 to 1984, this was the site of Louie's Sahara Inn Motor Hotel.", "The first official Gay bar in Windsor was called the Ritz on Pitt St.  It was run by Dick Casey (1935-2019). Casey never owned a bar but ran many bars for over 50 years.", "After the Ritz closed in 1981, Casey went on to work at the Cracker Barrel at 93 Riverside drive. The Cracker Barrel first opened in 1973 to 1976. It was then purchased by Marty Handelman and Murray Kirsh and changed it to the Riverside Follies. The Follies closed and the Cracker Barrel was back in 1980.  By September that same year the name changed to Louie’s. Louie’s’ had female impersonators such as the Gordon Ross Revue from Key West. And was considered a Gay bar ran by Casey. The bar also had go-go boys, male and female dancers, and disco dancing.  It didn’t last long. In 1982, just before it closed it was having a Mr. International Contest. It looks like the owners lost a suit with Lopatin Management and Investments Limited over their Tracy Starr’s Show in Edmonton. The building was put on auction. The Windsor building was never open again and was torn down in 1986.", "Now with Louie’s closed Casey moved on and was the manager of the Louie’s Sahara Inn. The place had 3 bars, swimming pool and hotel rooms. At one point it was advertised as the largest Gay bar in Ontario. It had drag shows on Wednesdays, female and male Go-Go dancers on Mondays, Male Dancers on Tuesdays, and Disco dance rooms. It even had a restaurant open after hours. The DJ Gary was very popular and was known to play more modern songs of the time and did requests. Jill Gamble who was a waitress both at Louies and the Sahara “loved working that bar and I enjoyed working with Dick, he was a funny man. My favourite people were the guys, once my laundry got thrown away by mistake the guys put on a barbecue and raised money for me to buy new clothes. Amazing people.” In 1983, she was recognized for her work with an award from the “Greater Windsor Foundation for her kindness and dedication.” She told me the reason she won the award was because she “took care of an older gentleman that lived at the Sahara his name was Mac.”", "Dion Carter a Gay Black man from Windsor would go the bar a few times but he always noticed that he would be one of the only Black people at the bar.  He also experienced different forms of racism including being objectified. When he went to the bar, patrons he didn’t know would physically touch him, including his private parts and asking him questions about his genitalia.", "One of the other attractions was the drink specials, no cover charge and on the weekends, you could go swimming. You could even rent out rooms for 24 hours. Some of the female impersonators that performed at the bar was Toronto’s Nussa Charles, Miss Gay Detroit: Wanda Simone, Kira St. Claire, Elaine St Jacques, Wanda Simone, Samantha Steward and James Estelle. As well as local drag queens such as Miss Lil.  It had all the thrilling elements of being one of the most exciting bars in this area. But it only lasted till 1984. I was told that it got raided many times for drugs, under aged drinking, and prostitution."], "timeline": null, "image": null}