{"id": "1280oa", "url": [{"path": "/photos/1280oa.jpeg", "type": "image", "imageAlt": "A newspaper ad for Louie's Sahara Inn with the tagline “Come on in and see the ‘surprise’ we have for you everyday at Louie’s!”"}], "description": ["From 1982 - 1984, this was the site of Louie's Sahara Inn Motor Hotel.", "The first official gay bar in Windsor was called the Ritz on Pitt St, and was run by Dick Casey (1935 - 2019). Casey never owned a bar but managed many bars over a period of 50 years.", "After the Ritz closed in 1981, Casey went on to work at the Cracker Barrel at 93 Riverside Drive, which first opened in 1973. It was later purchased by Marty Handelman and Murray Kirsh and the name was changed to the Riverside Follies. However, the Follies closed and the Cracker Barrel returned in 1980. By September that same year, the name once again changed to Louie's. Louie's featured female impersonators, such as the Gordon Ross Revue from Key West. It was considered a gay bar. The bar also had go-go boys, male and female dancers, and disco. It didn't last long however,and in 1982, the building was put on auction. The Windsor building was never open again and was torn down in 1986.", "After Louie's closed, Casey moved on and became the manager of the Louie's Sahara Inn. This place had 3 bars, a swimming pool, and hotel rooms. At one point, it was advertised as the largest gay bar in Ontario. It even had a restaurant open after hours. The DJ, Gary, was very popular, playing more modern songs of the time, and taking requests. Jill Gamble, who was a waitress both at Louies and the Sahara, “loved working that bar and I enjoyed working with Dick, he was a funny man. My favourite people were the guys. Once, my laundry got thrown away by mistake, and the guys put on a barbecue and raised money for me to buy new clothes. Amazing people.” In 1983, she was recognized for her work with an award from the “Greater Windsor Foundation for her kindness and dedication.” She told me the reason she won the award was because she “took care of an older gentleman that lived at the Sahara. His name was Mac.”", "Dion Carter, a gay Black man from Windsor, would go to the bar a few times, but he always noticed that he was one of the only Black people at the bar. He also experienced various forms of racism, including objectification. When he went to the bar, patrons he didn't know would physically touch him, including his private parts, and ask him questions about his genitalia.", "Some of the other attractions of the space included the drink specials, the lack of a cover charge, and swimming on the weekend. Rooms were available for rent for 24 hours at a time. Some of the female impersonators that performed at the bar included Toronto's Nussa Charles, Miss Gay Detroit: Wanda Simone, Kira St. Claire, Elaine St. Jacques, Wanda Simone, Samantha Steward, and James Estelle, as well as local drag queens such as Miss Lil.  It had all the thrilling elements of being one of the most exciting bars in this area, but it only lasted until 1984. It got raided many times for drugs, under-aged drinking, and prostitution."], "timeline": null, "image": "/photos/1280oa.jpeg"}