{"id": "1590oa", "url": null, "description": ["Early in the morning of September 2nd, 1984, a 31-year-old man named Ralph Fredsburg was strangled to death in his apartment. He was an active member of the gay community at the time, and he was known to write poetry. Earlier, in the 1970s, he had won the impromptu category in the public speaking contest at high school, talking about all things light bulbs, and once interviewed the mayor, Frank Wansbrough, about the lack of recreational facilities in South Windsor.", "In 1984, the year of his murder, he was working as a parking enforcement officer and was the steward for CUPE Local 543. He was seen the night of Septmeber 1st at JP's bar. After the fact, the police began doing interviews at JP's and several Detroit bars, ultimately conducting over 30. The reports on the incident changed their focus when it was stated in the paper that there could have been a “homosexual relationship between the dead man and his killer. Although it appears likely the killing had homosexual connotations, the police said there is little evidence to suggest the murder resulted from a quarrel between Mr. Fredsburg and a long-term lover.”", "Back in the 1940s, there was a serial killer who targeted gay men in Windsor, and so after Fredsburg's murder, the gay community became very scared, believing that there was a killer of gays in the city once again. Staff Sgt. Orval Hodkins confirmed that assaults against gay men was “not uncommon and many are believed to go unreported to police.” It wasn't until February 8th, 1985, that a 21-year-old man was arraigned on manslaughter. However, on May 8th, the charge was altered to second-degree murder. The trial began the following January. The 21-year-old's lawyer was Guy Cottrell, who used a “gay panic defense.” Cottrel was able to bring into evidence the testimony of Mike Ouellette, the apartment manager where the murder occurred. He stated that “Fredsburg frequented JP's Tavern“, which he knew as a meeting place for homosexuals, and he also was aware of many homosexuals made contact with other in local parks, such as Jackson and Dieppe but could not say whether Fredsburg had done that. He said he was aware “Fredsburg had many male visitors to his apartment...“, that he “had pornographic magazines in his apartment“, and that “some homosexuals indulge in S&M relationships (slave and master) and often use devices such as leather collars or belts around the neck to symbolize bondage“.", "Cottrel presented this as evidence that Fredsburg's murderer was defending himself against gay sexual advances. The alleged murderer testified that he was approached by Fredsburg on the street to go to his apartment for some beers. He indicated that previously that night, he went to several bars and was drunk at the time. They drank and smoked some cannabis before passing out. The 21-year-old argued that he woke up with Fredsburg “coming on to him” and that he hit him and left. Police testified that his initial statement was that Fredsburg was trying to take off his pants and push him, leading him to put Fredsburg in a headlock, before he fell on the floor. He then put the belt around his neck and left. The police indicated that the 21-year-old was asked who he killed, and he responded with “this fa****“, and when asked how, he said, “I strangled him with a belt... [he] tried to come on to me and I was freaked out.” He stated that he did not intend to kill him but was fending off a homosexual attack. Medical professionals testified that it would have taken at least 4 - 5 minutes to strangle Fredsburg. The murderer was described as “a married man with one child and no known homosexual tendencies“. During the investigation, there were witnesses that said to the police that they had seen the 21-year-old at JP's many times, but no witnesses were willing to testify publicly for fear of being outed. Joe MacFarland, a bartender of JP's at the time, believes that if just one person who saw him came forward, it would have changed everything.", "The last day of testimony included a statement that Fredsburg “preferred the company of young-looking straight or married men.” In the closing arguments, the Crown Attorney Tim Zuber supported the theory that Fredsburg was punched into unconsciousness and was strangled with a belt. Zuber also argued that the evidence of some homosexual practices was problematic especially when there was no evidence connecting Fredsburg to that activity. Zuber stated that the “murder of a homosexual is no different from any other murder... all life is equal. All people have equal rights in protection”. Cottrel once again closed with the evidence of the “sexual proclivities of the deceased [being] an important factor”. It took nine hours for the jury to come back with its verdict of either second-degree murder or manslaughter, and ultimately he was acquitted of both. Justice Maloney addressed the alleged murderer with “You are a very fortunate young man... Only you know what really happened in that apartment that night and I suspect none of us here in this courtroom heard all the truth of it”.", "Many in the community were outraged with the verdict and organized a protest at the county courthouse on February 14th. The protest garnished media coverage around Ontario. There was also a petition demanding an appeal of the verdict to the Attorney General of Ontario, but it was denied.", "Months later, the Windsor Star did a full-page article about Fredsburg, and his mother said ”it was 95% about homosexuality and 5% about murder”. The article included Fredsburg's poetry and history. This verdict was yet another example of how the justice system was often weighted against the queer community."], "timeline": null, "image": null}