{"id": "1590oa", "url": null, "description": ["It happened early in the morning of September 2nd, 1984. Fredsburg was 31 years old when he was strangled to death in his apartment. Fredsburg was more than his murder and early in his life there was a shimmer of the possible greatness he could have been. He was an active member of the Gay community at the time and was a budding poet.  In the 1970s, he won the impromptu category in the public speaking contest in this high school talking about all things light bulbs. In the same year, he interviewed the Mayor Frank Wansbrough about the lack of recreational facilities in South Windsor.", "The year of his murder, he was a parking enforcement officer and was the Steward for CUPE local 543. He was seen the night before at JP’s bar. The police began doing interviews at JP’s and Detroit bars. Over 30 interviews were conducted. The reports changed focus when it was stated in the paper that it could be a “homosexual relationship between the dead man and his killer. Although it appears likely the killing had homosexual connotations, the police said there is little evidence to suggest the murder resulted from a quarrel between Mr. Fredsburg and a long-term lover.”", "The Gay community became very scared thinking that there was a killer of Gays in Windsor again.  This was not the first time this has happened in Windsor. Back in the 1940s there was a serial killer who targeted Gay men before. Staff Sgt. Orval Hodkins did confirm that assaults against Gay men was “not uncommon and many are believed to go unreported to police.” There were no leads to the case and a $2500 Stoppers were brought in with $2500 reward. It wasn’t until Feb 8th, 1985, that a 21-year-old man was arraigned on manslaughter. On May 8th the charge was changed to second-degree murder.  The trial began in January of 1986. The 21-year-olds lawyer was Guy Cottrell. Cottrell defense was “the Gay panic defense.”   Cottrel was able to bring into evidence the testimony of Mike Ouellette the apartment manager where the murder occurred: “Fredsburg frequented JP’s Tavern, which he knew as a meeting place for homosexuals and he also was aware of many homosexuals made contact with other in local parks, such as Jackson and Dieppe but could not say whether Fredsburg had done that. He said he was aware Fredsburg had many male visitors to his apartment… he was also aware Fredsburg had pornographic magazines in his apartment…some homosexuals indulge in S&M relationships (slave and master) and often use devices such as leather collars or belts around the neck to symbolize bondage.”", "Cottrel presented evidence that Fredsburg’s murderer was defending himself against Gay sexual advances. The alleged murderer stated that he was approached by Fredsburg on the street to go to his apartment for some beers. He indicated that he had previously that night went to many bars and was drunk. They drank and smoked some pot and passed out. The 21-year-old argued that he woke up with Fredsburg “coming on to him” and that he hit him and left. Police testified that his first statement was that Fredsburg was trying to take off his pants and push him. He put Fredsburg in a head lock and he fell on the floor, he put the belt around his neck and then left. The police testified that the 21-year-old was asked who he killed he responded with “this fa**** and when he asked how, he said, “I strangled him with a belt…[he] tried to come on to me and I was freaked out.” He stated that he did not mean to kill him but was fending off a homosexual attack. Medical professionals testified that it would have taken at least four to five minutes to strangle Fredsburg. The murderer was “described as a married man with one child and no known homosexual tendencies. This is the part that gets very difficult to speak about. During the investigation by the police there were witnesses that said that they had seen the 21-year-old at JP’s many times, but no witnesses were willing to testify because they would be outed to the public.  Joe MacFarland, a bartender of JP’s at the time, believes if just one person who saw him came forward it would have changed everything.", "The last day of testimony included that Fredsburg “preferred the company of young-looking straight or married men.” In the closing arguments the Crown Attorney Tim Zuber supported the theory that Fredsburg was punched into unconsciousness and was strangled with a belt.  Zuber also argued that the evidence of some homosexual practices was problematic especially when there was no evidence connected to Fredsburg to that activity.  Zuber stated that the “murder of a homosexual is no different from any other murder… all life is equal. All people have equal rights in protection.” Cottrel once again closed with the evidence of the “sexual proclivities of the deceased [being] an important factor.” It took nine hours for the jury to come back with its verdict.  The jury had two options in front of them: second-degree murder or manslaughter.  He was acquitted of both. Justice Maloney addressed the alleged murderer with “You are a very fortunate young man… Only you know what really happened in that apartment that night and I suspect none of us here in this courtroom heard all the truth of it.”", "Many in the community were outraged with the verdict and organized a protest at the County courthouse on Feb 14th. The protest garnished media coverage around Ontario. There was also a petition demanding an appeal of the verdict to the Attorney general of Ontario but was denied.", "Months later the Windsor Star did a full-page article about Fredsburg, and his mother said it” was 95 per cent about homosexuality and five percent about murder.” The article included Fredsburg poetry and history. The verdict was seen yet another example of how the justice system was weighted against the Queer community."], "timeline": null, "image": null}