{"id": "2508da", "url": null, "description": ["In 1978, a Toronto woman visiting Windsor, whose deadname was printed in the Windsor Star, was murdered at the Windsor Motel. The paper reported that she was a 32-years-old “Black transvestite” who was found in a “woman's dress and coat.” The victim was known to have come to Windsor and stayed at the same motel many times.", "She was found dead on the motel's front lawn. The police were called shortly after 12:00 a.m. on May 7th, although they did not arrive until 2:00 a.m. and did not see a body. A constable went to the office of the motel, and the door “was slammed in his face”. The officer saw a man in the window “bent down to the floor and wiping something up”.", "This officer knocked on the door again, and a woman answered. He “asked about the report of a body and she told him that she had not called police and that the police were not wanted”, and which point they left.", "A couple hours later, ambulance attendants were dispatched, and they found a body “behind some bushes” around 4:30 a.m. The attendant on the scene believed that the woman had been dead for about two or three hours. She had been “severely beaten around the head, although those injuries would not have caused [her] death.” She died of a loss of blood because of the stab wound to her chest. It's believe that if the police would have responded to the crime immediately and not left the scene the first time, she might have survived.", "When the police did finally investigate the murder, they began to suspect four individuals. They found blood stains on the sidewalk and blood on one of the accused's t-shirts, as well as on a mop inside the building, and on a telephone receiver. Additionally, there was “bloodstained bedding in the washing machine in the basement and some other bloodstained clothing nearby”.", "Due to the scientific procedures of the time, it was not possible to identify the origin of the blood splatters, only blood type. Therefore, if a victim and their suspected killers had different blood types, they could make a strong case, but if they had the same blood type, they couldn't show the difference in the samples between the victim and the murderer.", "An analysis showed that blood of the same type as the woman was found on a table lamp in the room she was staying in, as well as on the bedsheets, recovered from the basement, but blood type was not taken from one of the accused because they supplied saliva samples instead and were not required to give both.", "There were also reports of arguing coming from Room 9 that was “consistent with a fight having taken place”. A 14-year-old testified that she had heard a voice from Room 8 “of a Black lady she had met earlier that day” as well the voices of the accused, who were renting Room 9. She heard “the Black lady crying for a while, and she overheard [the accused] tell her at one point to 'clean yourself up'”, before hearing the breaking of glass", "Other witnesses saw “a Black [wo]man running towards Dougall Avenue, followed by [two of the accused],” and another witness, William Kozak, testified that he was driving with his son shortly before midnight and noticed three people dragging what he said to his son looked like a sack of potatoes. One man waved at him to drive by and he identified one of the accused as that man. He then stated that he couldn't identify any of the other people. He thought at the time, that three men were dragging a body while one woman was standing by the side of Dougall Avenue. However, in cross examination, the witness conceded that he Dougall Rd ”could not positively swear that [one accused] was the man he saw”.", "One witness also testified that she “saw the two people accused of manslaughter [at the motel] with some blood on their clothing in the early morning”. She heard conversations about the accused needing to do some laundry.", "Four suspects were charged with murder in the first degree. At one point, one of the accused fled to British Columbia, but they returned for the trial, which took two days.", "All the blood evidence and the witness testimonies weren't enough unfortunately. In the end, only three people (two men and one woman) were charged with manslaughter. One of the accused died in a car accident before the trial and the defense used that death to their advantage, arguing that the accused dead man was the lone murderer, and the others were not involved.", "Unfortunately, the key Crown witness, Billy Walker, who was at the motel around the time of the woman's death, could not be found to testify.", "The judge, Justice Krever, ordered “a stay of proceeding” against the owner of the motel, even though they had been heard arguing with the victim, and the other two were found not guilty.", "Three months after the trial ended, one of the accused was charged again, this time for the attempted murder of a 33-year-old man. The charge was withdrawn because the victim “signed an affidavit indicating that the incident was an accident”.", "There was no justice for this unnamed woman and no one has ever been convicted for her death."], "timeline": null, "image": null}