{"id": "3301es", "url": [{"path": "/photos/3301es1.png", "type": "image", "imageAlt": "A black and white photo of a group of people holding a banner that reads “Metropolitan Community Church of Windsor. In Memory of Reverend Don McRae. Walks For Life”"}, {"path": "/photos/3301es2.png", "type": "image", "imageAlt": "A white frosted cake with a rainbow MCC logo and purple writing on it that says “MCC Windsor 25th Anniversary”"}, {"path": "/photos/3301es3.png", "type": "image", "imageAlt": "A closed building that represents what used to be the Metropolitan Community Church"}], "description": ["Metropolitan Community Church (MCC) was first founded in Los Angeles in 1968 by Rev Troy Perry. It now has churches in over 37 countries and 200 places around the world. Its first church in Canada was in Toronto in 1973. The first church in Detroit was in 1972 and was attended by many Windsorites.", "MCC has been one the most important local groups to the community for decades. It started in Windsor on January 8th, 1988, under the leadership of Rev. Don McRae. MCC had their first local service at Iona College.", "The goal of the Windsor MCC was to provide a spiritual home for lesbian, gay, bisexual, and transgender communities and for all who choose to join through the practicing of the gospel of Jesus Christ in worship, prayer, social action, education, fellowship, and generosity so that all people might experience God's liberating love, wholeness, and justice; come to live in right relationship with God and all creation; and have the courage to change the world.", "Before he became a Reverend for MCC, McRae was a Salvationist in Leamington. He got married to a woman at the time because the Salvation Army said the only way to become an officer would be if he had a bride. After five years, the marriage ended in divorce. Some time later, while living in Toronto, he connected with Brett Hawkes, the MCC leader in Toronto. Robin Sherman, an early parishioner of MCC told me that at the time, MCC in Toronto was wanting to expand the church in other areas. McRae and his partner Tony Dias ended up moving to Windsor with $100 that the Toronto MCC gave them. They first had a couple services at Iona Collage to see if there was an interest in Windsor. It appeared that there was, so both had their day jobs transfer them to Windsor and off they went. McRae headed the local Windsor group until he began to get sick, and Deacon Diane Skomash took over while he was too sick to work. McRae died of complications from AIDS in 1994. The church moved around over the years to other locations such as Mackenzie Hall, and back to Iona College, before MCC found this space.", "For decades, MCC Windsor has been a prominent fixture in the queer and trans community, including organizing events in the 1990s and having services on Sunday morning during Pride. It still exists today but at a much smaller level than it did in the past. Their existence has been seen throughout community events, city organizations, and having a presence in Pride endeavours around the city and county."], "timeline": {"header": "List of Pastoral Leaders of MCC", "list": ["1988 - 1994: Rev Don McRae", "1994 - 1996: Deacon Diane Skomash", "1996 - 1999:  Rev. Evan LeBlanc", "Jan - June 2000: Rev. Mark Bidwell", "Sept 2000 - Dec 2002: Rev. Marsha Dempsey", "Jan 2003 - Nov 2004: Rev. Brenda Hunt", "Nov 2004 - May 2016: Rev. Martha Daniels", "2016 - 2023: John Shellhorn"]}, "image": "/photos/3301es1.png"}