{"id": "500wa", "url": null, "description": ["Stephen Lopatin was murdered in his apartment in the early morning of November 5th, 1986. Lopatin was 35-years-old when he died, found stabbed over 15 times, including in the heart.", "During the trial, it was uncovered that Lopatin went to JP's, and at one point got banned from the bar because of his “aggressive behavior after 'grabbing' a patron there.” His roommate at the time was Michael Emery, who was not at the apartment when the crime happened. Emery testified that he “strongly denied suggestions that Lopatin had displayed homosexual or bisexual behavior”, although he agreed that he had once visited a homosexual bar with Lopatin. In the newspaper during testimony, Lopatin was identified as bisexual. He had grown up in a strongly religious Jewish family, and his father managed the Royal Furniture Company, which he also worked at as a salesman. A year before his death, his father died and left a great deal of money to him. Rabbi Martin J. Applebaum stated that Lopatin was known to have a drinking and drug problem and was self-destructive and unhappy after he dated a woman, and that months before his death he was trying to get closer to his faith. Applebaum felt there was “something that was missing in his life.”", "10 hours after the murder, there was an anonymous Crime Stoppers call that alerted the police. This was the first example of a homicide tip since the phone line was created. In the Windsor Star, Lopatin had been described as a “flamboyant dresser who wore expensive clothes and odd hats.” In most of the articles before the trial started, the name of the bars that he went to were not included. Robert Katzman, who was well known in the city for his strip bars, including Danny's, was quoted in the article saying, “I would see him every once in a while, intoxicated, but that isn't how I think of him... fundamentally [he] was a very good, decent person and a very good communicator. He loved to talk to people and had a very good sense of humor. Steve was the most non-violent individual ever. It's really a tragic story.”", "Two young men were first charged with the murder, an 18-year-old bus boy at Danny's, and a 19-year-old dancer at JP's. Both were released on bail, but the 19-year-old had his bail revoked. The 18-year-old got a plea agreement, pleading guilty to manslaughter, and receiving 3 years in jail as long has he testified in court. The 19-year-old pleated not guilty however.", "The basic story of the crime began with the three of them meeting up at Lips Tavern after drinking and doing cocaine. They decided to go to Lopatin's apartment afterwards. The 19-year-old testified that after they got to the apartment, Lopatin got two knives to cut some cocaine. The 18-year-old went to the washroom and Lopatin propositioned the 19-year-old for paid sex. After they finished, he expected to get paid $100 by Lopatin but Lopatin refused to pay him, and instead got aggressive and told him to “talk dirty to him” and Lopatin grabbed his testicles. “He shouldn't have touched me; I didn't want him to touch me.” Because of this, he began to stab Lopatin, “He grabbed me... everything happened so fast. I just felt him touch me and I stabbed him. I didn't mean to stab him; when he grabbed me, I stabbed him.” Once again, Windsor saw the “gay panic” defense used. The 19-year-old also admitted that he took money for sex acts in the past and that he was adult dancer at JP's. He also testified that he returned to the scene of the crime the next day and he was the one who called Crime Stoppers. The prosecution attorney argued that this was “in the hopes they would believe Lopatin had been killed by a drug dealer.”", "The 18-year-old's story was very different, stating the intent was to rob Lopatin, and including none of the sexual aspects. He stated that the knives were brought out to cut the cocaine that Lopatin offered them. The 19-year-old “thrust the knife at Lopatin's chest and demanded money. When they found none that “is when he was stabbed over 15 times” until, as the 18-year-old testified, to “make sure he's dead.” Afterwards, they ransacked the place, and a gym bag of Lopatin's was found under the 18-year old's porch. The bag included two knives wrapped in tea towels, one with blood on it.", "The jury was told by Justice Thomas Callon, that if the 19-year-old was “provoked into stabbing Lopatin, that they would then only reduce murder to manslaughter.” But if the intent of the crime was robbery and the knife was part of the robbery, it was second-degree murder. The 19-year-old was found not guilty of second-degree murder, but guilty of manslaughter. He received 6½ years in jail."], "timeline": null, "image": null}