{"id": "93rde", "url": null, "description": ["During the 1945 Slasher Killings, the police interviewed a woman named Margo Hind. She told the police that it was a popular bar for homosexuals. This is the only reference we have for this.", "It was sold to George and Ileana Spoiala and he changed the name to the Ritz Hotel in 1955. There was already a Ritz Hotel on the corner of Ouellette and Riverside, just opposite the British American Hotel. It was also owned by the Spoiala's which they purchased in 1947. The Spoiala's did renovations to the Ambassador Hotel and called it the New Ritz Hotel in 1949. He did this because the city took over the Ritz Hotel on Ouellette and purchased it for $285,000 which he originally refused the offer but ended up selling, which was the largest city purchase at the time. It was demolished in 1955, but not without issues. When they tore down the building the rubble fell on another adjacent Hackney Cartage building. The owners sued the city, but the building was also demolished to create the new space which became Dieppe Park a memorial space for the local fallen of World War Two.", "In 1973, the name changed to the Cracker Barrell. Sometime around 1976 - 1977 the space became the Riverside Follies when Handelman and Kirsh bought the Ritz hotel. Mr. Shawn Adams, a female impersonator from Tracy Starr's who had been preforming in Detroit at the Park Burlesque would take over as MC at the follies. Adams, who choreographed in New York would design and oversee the shows.  He performed an X-rated routine where including him stripping. He also still worked in Detroit as the “Greatest Female Impersonator” until he ended up moving to Sarnia to open a club. From Sarnia he went to Edmonton to be the MC for the opening of Tracy Starr club there in 1977. By April of 1978 Adams stopped performing at the bar in Edmonton based on “circumstances beyond our control.” I have not been able to find any more information about him since that statement in 1978.", "Liz Lyons (1919 - 1991) would also perform at the Follies from 1977 - 1980 and continued to perform at Louie's and at Cheetah's till 1986. At one point she was marked as Windsor's X-rated Grandmother comic. Lyon performed as a Female impersonator under the name Lee Leonard in the 1940s - 1960s around the United States and especially Vancouver from 1960 - 1969 when she changed her name to Lyon. She put out a LP in the 1970s called “Up Your Ass” and even performed for Johnny Carson and David Letterman. Lyon's was born in Chicago and was Trans. She received one of the first gender affirming surgeries in Minnesota in 1968. She toured all over Canada and United States. One of her last shows being at Smuggles in Owen Sound, Calhoon's in Sarnia in 1989 and Continental Motel Hotel in Winnipeg. She called St. Catharines her home.", "After the follies closed it opened as Louie's under the management of Dick Casey as a gay bar. It lasted for about a year. The building was torn down in 1987."], "image": null}