{"id": "93rde", "url": [{"path": "/photos/93rde.png", "type": "image", "imageAlt": "An old black and white newspaper clipping with a picture of the Ambassador Hotel and the heading “One of Windsor’s Three Principal Hotels”"}], "description": ["During the 1945 slasher killings, the police interviewed a woman named Margo Hind. She told the police that it was a popular bar for homosexuals. This is the only reference we have for this.", "It was sold to George and Ileana Spoiala and he changed the name to the Ritz Hotel in 1955. There was already a Ritz Hotel on the corner of Ouellette and Riverside, just opposite the British American Hotel. It was also owned by the Spoialas, which they purchased in 1947. The Spoialas did renovations to the Ambassador Hotel and called it the New Ritz Hotel in 1949. He did this because the city took over the Ritz Hotel on Ouellette, purchasing it for $285,000. He originally refused the offer but ended up selling, which was the largest city purchase at the time. It was later demolished in 1955, but not without issues. When they tore down the building, the rubble fell on another adjacent Hackney Cartage building. The owners sued the city, but the building was also demolished to create the new space which became Dieppe Park, a memorial space for the local fallen soldiers of World War II.", "In 1973, the name changed to the Cracker Barrel. Sometime around 1976 - 1977, the space became the Riverside Follies when Handelman and Kirsh bought the Ritz Hotel. Mr. Shawn Adams, a female impersonator from Tracy Starr's who had been performing in Detroit at the Park Burlesque, would take over as MC at the Follies. Adams, who choreographed in New York, would design and oversee the shows.  He performed an X-rated routine which including him stripping. He also still worked in Detroit as the “Greatest Female Impersonator” until he moved to Sarnia to open a club. From Sarnia, he went to Edmonton to be the MC for the opening of the Tracy Starr Club there in 1977. By April of 1978, Adams stopped performing at the bar in Edmonton based on “circumstances beyond our control.” Very little information is available about him after this statement in 1978.", "Liz Lyons (1919 - 1991) would also perform at the Follies from 1977 - 1980 and continued to perform at Louie's and at Cheetah's until 1986. At one point, she was marked as “Windsor's X-rated Grandmother Comic”. Lyons performed as a female impersonator under the name Lee Leonard in the 1940s - 1960s, across North America, including Vancouver from 1960 - 1969, at which point she changed her name to Lyon. She put out an LP in the 1970s called “Up Your Ass” and even performed for Johnny Carson and David Letterman. Lyons was born in Chicago and was trans. She received gender-affirming surgery at the University of Minnesota Gender Clinic in 1968. Some of her final shows were performed in the late 1980s at Smuggles in Owen Sound, Calhoon's in Sarnia, and the Continental Motel Hotel in Winnipeg. For some time, she called St. Catharines her home.", "After the Follies closed, it re-opened as a gay bar called Louie's, under the management of Dick Casey. It lasted for about a year before the building was torn down in 1987."], "image": "/photos/93rde.png"}