{"id": "acw", "url": [{"path": "/photos/acw.png", "type": "image", "imageAlt": "The window of the ACW with a sign in it that reads “Get The Facts. Call 256-AIDS”"}, {"path": "/photos/acw2.png", "type": "image", "imageAlt": "An Aids Committee of Windsor poster that reads “Devoted to mobilizing our communities through education, advocacy, and support to respond effectively and with compassion to the AIDS crisis”"}], "description": ["In December 1985, the AIDS Committee of Windsor was founded and this would become its first location. It originally started out of the “Condom Committee” of the Lesbian/Gay Community Service Group (LGCSG). There was some debate on what they should call this new institution. Jim Monk liked the phrase ”AIDS Committee of Essex”. His rationale was to make sure to incorporate the county in the title. Wayne Tennant saw that the acronym ACE could be linked to the Ace of Spades playing card which also could be connected to the death card in the tarot, so for this reason the idea was dropped.", "The founding members of the ACW were Jim Monk, Barry Adam, John Dufour, Wayne Tennant, and Colleen Gallagher, with Kevin Bishop and Beth Lyster also applying for funding. Wayne Tennant was the first chairman.", "The group originally started out of Jim Monk's house, because his place was generally available during the day.", "Kevin Bishop applied for funding to employ an Executive Director, and it was decided by the founders that he would be the first appointed. He was young at the time and didn't have a career like most of the others.", "Once they had an Executive Director, they needed to find a place of their own, but the group had a very difficult time finding anyone who would rent to them. They hired a realtor to help them find a place, but when they were open about the purpose of the space and group, no property owners wouldn't rent to them. At that time, most places didn't want anything to do with an AIDS organization."], "timeline": {"header": "Buildings Timeline", "list": ["Winter 1987: 3178 Walker Road", "January 1988 - 1990: 1586 Wyandotte Street East, Suite 205", "1990 - 1994: 1050 University Avenue West", "1994 - 1996: 2090 Wyandotte Street East", "1996 - 2006: Gino Marcus Community Centre, 1168 Drouillard Road", "2006 - 2021: 511 Pelissier Street", "2021: Changes name to Positive Pathways"] }, "image": "/photos/acw.png"}