{"id": "ccs", "url": [{"path": "/photos/ccs.png", "type": "image", "imageAlt": "An old photo of protesters holding signs with various statements like “I'm Gay and Proud”, “Support John Damien”, and the like"}, {"path": "/photos/ccs2.jpeg", "type": "image", "imageAlt": "John Damien's headstone with little bi, rainbow, pan, trans, and ace flags placed in the ground around it"}, {"path": "/photos/ccs3.jpeg", "type": "image", "imageAlt": "A man holding a protest sign that says “Gay is Good” standing in a group of people also holding protest signs"}, {"path": "/photos/ccs4.jpeg", "type": "image", "imageAlt": "Two men smiling for the camera, one holding a protest sign that says “Support John Damien”"}, {"path": "/photos/ccs5.jpeg", "type": "image", "imageAlt": "A sepia photo of a man in polo gear"}, {"path": "/photos/ccs6.jpeg", "type": "image", "imageAlt": "A small group of people holding protest signs in support of John Damien"}, {"path": "/photos/ccs7.jpeg", "type": "image", "imageAlt": "A letter written to the chairmen and general council delegates of the Local 195 union on behalf of the 195 Human Rights committee requesting that all plant units review their no discrimination clauses in existing contracts"}], "description": ["In 1974, the Local 195 of the CAW Human Rights Committee, led by Les Dickirson, recommended that all CAW bargaining units revise the anti-discrimination clause in their collective agreement to include sexual orientation. And three years later, on March 14th, 1977, Windsor City Council passed a non-discrimination clause that included sexual orientation for city collective agreements. They were the third city in the country to include those contract previsions. The resolution was carried by a narrow margin of 4 to 3, and only after outbursts of homophobic comments from several members of council and spectators. James Wiggins, a member of the public who spoke about it said “homosexuals chose their lifestyle and should not be given special consideration by a council... homosexuality is not 'rained down by God' nor caused by a chemical imbalance, but is something that is willingly chosen 'just like biting one's nails'.” Harold Desmarais remembered arguments during the council meeting around that gays and lesbians using washrooms that misaligned with their assigned gender if such a clause were to pass. David Burr, Henry Shanfield, and Shirley Campbell supported the clause however, with Maurice Armstrong, Louis Parent, and Tom Toth voting against. Don Clarke was absent for the vote, and Ron Wagenberg (a University of Windsor political science professor) was the swing vote. The WGU had lobbied him for support of the resolution for a long time. This event was covered through many gay newsletters all over North America, and even in parts of Europe.", "In 1975, Windsorite John Paul Damien was fired from the Ontario Racing Commission in Toronto because he was gay, and this became a rallying cry for the Coalition from Lesbian & Gay Rights in Ontario. On October 22, 1977, twenty-four people protested employment discrimination against gays and lesbians in support of John Damien. They demonstrated in front of an Ontario government building, before marching through the city market and along the main street. Damien is considered one of Windsor's gay heroes, but unfortunately, many people in the city have no idea who he was and why he's held in such regard. He wasn't born in Windsor, but rather in Ste-Croix de Lotbinière, Québec. Born under the name Jean Paul, but generally called ”Johnny” by his loved ones, his family spoke French at home. Damien's parents moved to Windsor when he was very young so his father could work at the Ford Motor Company in Detroit. Damien later went on to start Damien Construction Company in Windsor. It was in 1970 that he became a supervisor of racing for the Ontario Racing Commission (ORC), and in 1971, he became a Steward, one of only three people in Ontario who enforced the rules of racing. At the time, he was making around $25,000 (the equivalent of $125,000 today) a season.", "He kept this prestigious job for four years until he got a call on February 5, 1975, from P. C. Williams, an employee of the Ministry of Consumer and Commercial Relations for Ontario. The next day, he showed up for a meeting and was handed a letter and told to read it. It was his resignation, stating that Damien would not be re-applying for his job as Steward for the upcoming summer season. He was then asked to sign it. At the time, Damien asked why, was was told by Williams that ”the Ontario Jockey Club did not want [him] in the stands for the 1975 season, and that Mr. McNaughton ha[d] sent his letter, which state[d], 'You are not to be reappointed.'” He asked ”Why? Is it because I wasn't doing the job?”, to which he was told no. Then asking, “Is it because I am a homosexual?”, he was told yes, before he was warned of blackmail for ”putting the commission in a bad light”. He was offered $1,200 to take the resignation, but he didn't, at which point they raised the offer to $1,700 and a letter of recommendation, which he still didn't take.", "Frustrated, the Ministry agreed to meet Damien again the next day. When the time came, Damien still refused, but the Ministry didn't budge. Damien told them that he was not resigning and that he was going to fight this publicly, and then left.", "A friend of his had left a pamphlet by Gay Alliance Towards Equality (GATE) in his penthouse condo, who he called to get some advice. GATE gave him the phone number of a lawyer and set up a meeting. Representatives from both GATE and the Coalition for Gay Rights in Ontario (CGRO) went to the meeting, and together, they came up with a plan to fight the decision.", "On February 14, 1975, Damien went public, and the next day, his story was picked up nationally. The Windsor Star's headline was “Homosexual Fired as Racing Steward.” Two years later, there was a call to action with an official protest in support of Damien across the country. It was called the Nationwide Damien Days of Protest and lasted over two weeks across the country, starting off in Halifax, where Damien addressed a group at the Atlantic Gay Conference. On October 15, there was a Faire Réengager John Damien in Montréal, and October 21 was Edmonton's day, where Damien spoke at a Unitarian church. On October 22, Windsor participated in the protest on the same day as Vancouver, both cities getting extensive local coverage. This was Windsor's first official gay rights protest, and almost 30 people attended. The protestors demonstrated in front of the downtown Ontario Government building at 250 Windsor Avenue and then marched through the city market and along Ouellette Avenue, carrying signs and handing out leaflets. This historic first for Windsor lasted for two hours. Yet, most places around the country ignored the day, and there was very little national coverage of it.", "The following year, in July of 1978, three years after Damien's incident, Halifax hosted the 6th Annual Conference for Lesbians and Gay Men, where Damien spoke and received a standing ovation from the crowd. There was even a Damien Workshop that people could attend.", "Mney was coming in from all over North America, and some even came from New Jersey with an enclosed letter that stated, “Lets send homophobia to the glue factory”. But it took until January 1985 before a single lawsuit against his former employers worked its way to be presented before a court of law. Damien stated “I made a promise in 1975 that I was going to see this to the end. Even my own close friends don't understand. I don't feel any worse for it. Matter of fact, I feel pretty good.” Damien “did not see himself as a martyr but an example of what had to be done to guarantee basic individual and human rights”. After endless difficulties, in 1986 Damien found out that he was ill with pancreatic cancer and returned to Windsor. That July, he moved in with his sister, a trained nurse named Jacqueline Deschamps.", "Even when he was dying, the case was always on his mind, and he was adament that he would not give up on a cause he felt would define him forever. On November 9, 1986, he wrote a letter to the CGRO stating “My physical well-being is in question at the moment, and I cannot anticipate what the outcome will be. The lawyers have been meeting and discussing the changes surrounding the actions. The main concern is the effect these actions have taken in shortening my life, and future pressure/stress cannot be overlooked... I have to hope that everything will turn out alright legally and medically”. Later that month, the ORC settled out of court with just two weeks before the law in Ontario would include sexual orientation as part of the Human Rights Code. Over $100,000 had been spent on this cause.", "Damien received a year's wages plus interest for wrongful dismissal (which amounted to around $50,000). However, he wasn't allowed to touch the money until the case against his former doctor was finished. That case continued, but he was too ill at this point to testify for it, and the lawyers in Toronto kept on delaying it. They gave him three offers, but “each time, the terms stipulated that Damien must agree never to divulge the amount of the settlement nor to ever speak publicly about any aspect of his case again”. Damien was very upset by the offers. Damien asked, “Do they really think that I endured all that I have for the last 11 years just to be blackmailed into silence?”", "On December 2, 1986, Ontario finally passed an amendment to include sexual orientation in the Human Rights Code. The vote was 64 to 45, and was supported by Remo Mancini (Liberal - Essex South), Bernard Newman (Liberal - Windsor Walkerville), William Wrye (Liberal - Windsor Sandwich), Dave Cooke (NDP - Windsor Riverside), and Patrick Hayes (NDP - Essex North), among others. This made Ontario the second province to pass this sort of amendment, after Québec, who had passed it in 1977.", "Damien was reportedly happy at the bill's passage and felt that it had vindicated him, saying “It's about time the government decided favorably on this issue. So many, many people have been really harmed, and they've had no recourse. Now we can feel part of society”.", "Damien later died on Christmas Eve at 9:00 p.m., 22 days after the law was passed and 6 days before it was enacted. He was 53 years old. He's buried with his parents under his birth name in Saint Alphonsus Roman Catholic Cemetery on Shepherd Street East. As he was unable to afford a new headstone, his name is engraved on his parents' in small letters in the space beneath their names.", "Windsor Pride was later celebrated many times in this area, including in 1998, at City Hall Square, and from 2002 - 2006, at Charles Clark Square. The year 2000 was the first time the City of Windsor raised the Pride flag at City Hall, having been unanimously voted on by the council."], "timeline": null, "image": "/photos/ccs.png"}