{"id": "ccs", "url": [{"path": "/photos/ccs.png", "type": "image", "imageAlt": "An old photo of protesters holding signs with various statements like “I’m Gay and Proud”, “Support John Damien”, and the like"}], "description": ["In 1974, the Local 195 of the CAW Human Rights Committee, led by Les Dickirson, recommends that all CAW bargaining units revise the anti-discrimination clause in their collective agreement to include sexual orientation. March 14th, 1977, Windsor City Council passed a non-discrimination clause that included sexual orientation for city collective agreements. The third city in the country to include those contract previsions. The resolution was carried by a narrow margin, four to three, and only after outbursts of homophobic comments from members of council and spectators.  James Wiggins member of the public who spoke about it said, “homosexuals chose their lifestyle and should not be given special consideration by a council…homosexuality is not ‘rained down by God’ nor caused by a chemical imbalance but is something that is willingly chosen ‘just like biting one’s nails.” Harold Desmarais remembered arguments during the council meeting concerned that gays and Lesbians might use the wrong washrooms if it passed.  David Burr, Henry Shanfield and Shirley Campbell supported it. Maurice Armstrong, Louis Parent and Tom Toth voted against it. Don Clarke was absent for the vote. Ron Wagenberg (University of Windsor political science professor) was the swing vote. WGU had lobbied him for support of the resolution for a long time. This event was covered through many gay newsletters all over North America and even in Europe.", "In 1975, Windsorite John Damien was fired from the Ontario Racing Commission in Toronto because he was Gay. This became a rallying cry for the Coalition from Lesbian & Gay Rights in Ontario.", "On October 22, 1977, twenty-four people protested employment discrimination against Gays and lesbians in support of John Damien. They demonstrated in front of an Ontario government building before marching through the city market and along the main street.", "Windsor Pride was celebrated many times in this area. In 1998 at City Hall Square and from 2002 to 2006 at Charles Clark Square.", "We’ve seen many great heroic acts happen in Windsor’s 2SLGBTQAI+ community throughout the years, but there is no one who has made as much of a national mark as John Damien. He’s one of Windsor’s most important Queer heroes.", "Unfortunately, most people in the city have no idea who he was and why he’s considered a hero in the first place.", "Jean Paul Damien was not born in Windsor. He was born in Ste-Croix de Lotbinière, Québec, and his family spoke French at home—but they all called him “Johnny.” Damien’s parents moved to Windsor when Damien was very young so his father could work at the Ford Motor Company in Detroit. He later started Damien Construction Company in Windsor.", "In 1970, he became a supervisor of racing for the Ontario Racing Commission (ORC), and in 1971, he became a Steward, one of only three people in Ontario who enforced the rules of racing.  He was making around $25,000 (the equivalent of $125,000 today) a season. He kept this prestigious job for four years until he got a call on February 5, 1975, from P. C. Williams, an employee of the Ministry of Consumer and Commercial Relations for Ontario. On the sixth, Damien showed up for a meeting. He was handed a letter and told to read it.", "It was his resignation.", "It stated that that Damien would not be re-applying for his job as steward for the upcoming summer season. He was asked to sign it. Damien asked why:", "Williams told me that Ontario Jockey Club did not want me in the stands for the 1975 season and that Mr. McNaughton ha[d] sent his letter, which state[d], “You are not to be reappointed.” I asked again: “Why? Is it because I wasn’t doing the job?” He said no. I asked him, “Is it because I am a homosexual?” He said yes. And then he told me I could be blackmailed—I could put the commission in a bad light.", "He was offered $1,200 ($6,000) to take the resignation. He didn’t.", "He was then offered $1,700 ($8,500) and a letter of recommendation. He still didn’t take it.", "Frustrated, the Ministry agreed to meet Damien again the next day. When the time came, Damien still refused.", "But the Ministry didn’t budge.", "Damien told them that he was not resigning and that he was going to fight this publicly, then left.", "A friend of his had left a pamphlet by Gay Alliance towards Equality (GATE) in his penthouse condo. He called to get some advice. Immediately, GATE wanted to help him. They gave him the phone number of a lawyer and set up a meeting with Damien. Representatives from both GATE and the Coalition for Gay Rights in Ontario (CGRO) went to the meeting, and together, they came up with a plan to fight the decision.", "On February 14, 1975, he went public, and the next day, his story was picked up nationally. The Windsor Star’s headline was “Homosexual Fired as Racing Steward.”", "In 1977, there was a call to action with an official protest in support of Damien across the country. It was called the Nationwide Damien Days of Protest and lasted over two weeks across Canada, starting off in Halifax, where Damien addressed a group at the Atlantic Gay Conference. On October 15, there was a Faire Réengager John Damien in Montréal, and October 21 was Edmonton’s day, where Damien spoke at a Unitarian church.", "October 22 was Windsor’s day to participate in the protest, as well as Vancouver’s. Both cities got extensive local coverage. It was Windsor’s first official Gay rights protest, and almost 30 people attended. The protestors demonstrated in front of the downtown Ontario Government building at 250 Windsor Avenue and then marched through the city market and along Ouellette Avenue, carrying signs and handing out leaflets. This historic first for Windsor lasted for two hours.", "Yet, most places around the country ignored the day, and there was very little national coverage of it.", "In July 1978, Halifax hosted the 6th Annual Conference for Lesbians and Gay Men. Damien spoke at the conference and received a standing ovation from the crowd. There was even a Damien Workshop that people could attend.", "In short, money was coming in from all over North America. Some even came from New Jersey with an enclosed letter that stated, “Let’s send homophobia to the glue factory.”", "It took until January 1985 before a single lawsuit against his former employers worked its way to be presented before a court of law. Damien stated “I made a promise in’75 that I was going to see this to the end. Even my own close friends don’t understand. I don’t feel any worse for it. Matter of fact, I feel pretty good.”  Damien “did not see himself as a martyr but an example of what had to be done to guarantee basic individual and human rights.”", "After endless difficulties, in 1986, Damien found out that he was ill with pancreatic cancer and went back to Windsor. In July, he moved in with his sister, Jacqueline Deschamps. His sister was a trained nurse.", "Even when he was dying, the case was always on his mind. He would not give up on a cause he now felt would define him forever. On November 9, 1986, he wrote a letter to the CGRO. “My physical well-being is in question at the moment, and I cannot anticipate what the outcome will be. The lawyers have been meeting and discussing the changes surrounding the actions. The main concern is the effect these actions have taken in shortening my life, and future pressure/stress cannot be overlooked . . . I have to hope that everything will turn out alright legally and medically.”", "In November of 1986, the ORC settled out of court with just two weeks before the law in Ontario would include sexual orientation as part of the Human Rights Code. Over $100,000 had been spent on this cause.", "Damien received a year’s wages plus interest for wrongful dismissal—around $50,000. But he wasn’t allowed to touch the money until the case against his former doctor was finished. That case continued, but he was too ill to testify for it. The lawyers in Toronto kept on delaying it.", "They gave him three offers, but “each time, the terms stipulated that Damien must agree never to divulge the amount of the settlement nor ever to speak publicly about any aspect of his case again.”  Damien “was offered generous settlements in the court case, but only with the condition that a ‘gag order’ be imposed that would stop any discussion of the settlement or the case.”", "Damien was very upset by the offers. Damien asked, “Do they really think that I endured all that I have for the last 11 years just to be blackmailed into silence?”", "It was on December 2, 1986, that Ontario passed an amendment to include sexual orientation in the Human Rights Code. The vote was 64–45: Remo Mancini (Liberal—Essex South), Bernard Newman (Liberal—Windsor Walkerville), William Wrye (Liberal—Windsor Sandwich), Dave Cooke (NDP—Windsor Riverside), and Patrick Hayes (NDP—Essex North) all supported it. This made Ontario the second province to do so after Québec, who had passed it in 1977.", "Damien “was happy at the bill’s passage and felt that it had vindicated him” and said, “It’s about time the government decided favorably on this issue. So many, many people have been really harmed, and they’ve had no recourse. Now we can feel part of society.”", "Damien died on Christmas Eve at 9:00 p.m., 22 days after the law was passed and six days before it was enacted. He was 53 years old.", "He’s buried with his parents under his birth name, Jean Paul, in Saint Alphonsus Roman Catholic Cemetery on Shepherd Street East. As he was unable to afford a new headstone, his name is engraved on his parents’ in small letters in the space beneath their names.", "In 2000, was the first time the City of Windsor raised the pride flag at city hall. It was unanimously voted on by the council."], "timeline": null, "image": "/photos/ccs.png"}