{"id": "fp1992", "url": [{"path": "/photos/fp1992.png", "type": "image", "imageAlt": "A flyer for Lesbian and Gay Pride Day 1992 with the caption “Get Used to It” and various event info such as the day’s itinerary (live outdoor entertainment, DJ & dancing, bar-b-que, dunk tank, volleyball, & miss pride day ‘92 pageant), and the number to The Lesbian & Gay Pride Committee Hotline"}], "description": ["July 12, 1992, began a very important tradition for the Windsor community: it was the first year of the decades long tradition of the 2SLGBTQAI+ Pride Parade.", "This was not the first Gay celebration event in our area. Windsor has been recognizing the community since 1973 with dances, workshops, and public protests. What was different from past celebrations was the parade.", "Windsor was always overshadowed by Detroit in these celebrations, but in 1992, the event was slightly different from the past ones. It was organized by Windsorites for Windsorites, and it was the first time the city officially endorsed any type of LGB celebration. Jacob Jacoby (chair of the Pride Committee) explained why it happened so late in the Windsor community compared to other cities: “Many people who became prominent in the Gay rights movement in larger cities originally came from Windsor but didn’t stay here…And those activists who remained put all their energy into the AIDS crisis in the 1980s.”", "Caroline Carnerie, one of the founders of the 1992 celebration, remembers that “the core group [was] two ACW—AIDS Committee of Windsor staff members, Jamie Pitts and me, and two ACW volunteers, David Grenier and David Jakoby.” The original group was not part of any official ACW planning committee. They simply knew each other from ACW. Carnerie also remembers that “for those of us at the ACW, I know that it was apparent that there was an undeniable intersection between health care, self-esteem, and human rights. And thus, pulling together a Pride event seemed like a natural step for us to take. It was imperative, really. Nothing like that had ever been done in Windsor, and we wanted to make some noise.”", "They decided not to do the Pride event in June, which is the typical time in North America, because they felt they would not get as many people to participate as attendees would probably go to Toronto or Detroit instead. So, July was picked, and the theme of the day would be “Get Used to It.” It would be only for one day, a Sunday.", "And after many years of Queer events trying to get the City’s support, it finally happened.", "This time, the City Council made an official proclamation. There was some backlash about Council supporting it, especially from Tom Porter, who said, “I don’t feel this requires a municipal endorsement.” Councillors David Cassivi, Margaret Williams, and Tom Toth all felt that “Council should not get involved in supporting individuals’ sexual preference.” Jacoby spoke back in response to the prejudice: “Every day is heterosexual pride day.” Jakoby hoped “that this type of event would encourage more people to be openly Gay or lesbian in their hometown.”", "Carnerie remembers: “How nervous I was that we could be simply rejected, but when the vote was counted unanimously to approve the event, the gallery behind me erupted with cheers. I remember the [electricity] in the room at that moment, but I’m pretty sure we were going to have our event with or without approval.”", "Jamie Pitts remembers that “Caroline came to the rescue for the City Hall presentation and did a marvelous job. It was difficult at the time to find women who would be a public face [for] the event, and Caroline struggled with whether or not she was the right person—but she ABSOLUTELY was.”", "Carnerie, who is a straight ally, felt “the thing is that I was using the hell out of my straight white privilege and status as an outspoken law student to push the agenda. I had no fear of rejection.”", "The proclamation stated:", "Whereas: The community of Windsor includes among its diverse population many lesbians, Gays, and bisexuals;", "Whereas: Many lesbians, Gays, and bisexuals remain invisible under continued threat of hatred, oppression, prejudice, and discrimination;", "Whereas: Many lesbians, Gays, [and] bisexuals have played vital roles in the progress and development of our community and the betterment of society;", "Whereas: Individual self-esteem and community pride stem from the recognition of accomplishments;", "Whereas: Windsor City Council is dedicated to the provision of human rights for all its citizens and the eradication of discrimination based on sexual orientation;", "Therefore be it resolved: That Sunday, July 12, 1992, be proclaimed “Lesbian, Gay, and Bisexual Pride Day.”", "Windsor was the fourth city in the province to “officially” make such a proclamation."], "timeline": null, "image": "/photos/fp1992.png"}