{"id": "gc", "url": [{"path": "/photos/gc1.png", "type": "image", "imageAlt": "A flyer for The Complex that promotes two levels: the bar & grill on the main level, and the dance club of the second level. At the bottom, it says that the establishment is 100% gay owned and operated"}, {"path": "/photos/gc2.jpeg", "type": "image", "imageAlt": "An army photo of Jack Bickle in full regalia"}], "description": ["The third most important bar for the queer community is regarded to have been on 634 Chilver Rd. It had various names over the years: Club Nostalgia, Franky's, Plum Cooley's, and Complex.", "The space has been used for decades as a social area. In the 1940s, it was the Odd Fellows Hall, which hosted Halloween and New Years parties. It was also used by Jack Bickle for a dance studio that offered ballet, acrobatics, and ballroom dancing classes in 1941. Bickle was a gay war veteran, an important artist, and a University of Windsor professor.", "In 1965, this location was turned into a charity house which was a “permanent quarters for transient and down-and-out persons”, operated through a religious lens. They hosted Christmas meals, a soup kitchen, and a residence for men.", "In 1976, when it became Franky's, “five modern halls for rent for all occasions” became available for the following decade. Later, in 1987, it re-opened as a sports bar and became a singles dance space on Saturdays, but there was a policy that “no blue denim jeans” where allowed to be worn.", "In the 1990s, it separated into two spaces, one named Memory Lane, and the other, known as Club Nostalgia, was upstairs. 1997 was when the bar officially became a gay space, however, changing its name to Franky's once more the following year. In 1999, the upstairs was renamed Plum Cooley's. On Wednesdays, the Metropolitan Community Church (MCC) met and there was often euchre nights, while Fridays and Sundays were karaoke. The space also had pool tables and a shuffleboard area.", "June Willier was an employee there from 1999 until the space closed in 2005.", "In 2000, the name of the upper floor changed once more, to the Complex Bar. This was owned by Robert Sarra and David Ruxton, who did some renovations on the place with a new light system and a video bar. As part of their new look, they even started a free newsletter called the Complex Times, edited by D.S. Watts. This newsletter didn't last very long and was mostly filled with ads and some short texts. They also hosted Pride events and served as the final stop for the Pride march. During Pride week, they had a barbeque, a dance party, a tea dance, a karaoke contest, a white party, and a drag show that starred April Summers and LululaMore, among others. They re-opened the first floor a few months later, which now had a glass garage door that would open during the spring and summer months. They had a full kitchen menu, and they even leased a parking area close to the bar with security. The Complex hosted Pride for many years until its closure in 2005. This was the last large scale gay club in Windsor. After that point, there were other bars, but generally much smaller in size, and serving more as a basic area to hang out, rather than a huge dance space. The space stayed vacant for a good while until it was later revamped into individual store fronts, with varied stores using it today, including a dance studio."], "timeline": null, "image": "/photos/gc1.png"}