{"id": "gc", "url": null, "description": ["The third important bar for the Queer community was on 634 Chilver Rd. It had various names over the years: Club Nostalgia, Franky’s, Plum Cooley’s and Complex.", "The space has been used for decades as a social area. In the 1940s it was the Odd Fellows Hall. Which hosted Halloween and new year’s parties. It was also used by Jack Bickle for a Dance Studio that offered Ballet, Acrobatic and Ballroom dancing classes in 1941. Bickle was Gay, a war veteran and an important artist and University of Windsor professor.", "In 1965, it was changed into a charity house which was a “permanent quarters, transient and down-and-out persons,” through a religious lens. Which hosted Christmas meals, soup kitchen and the residence for men.", "This all changed in 1976 when it became Franky’s “5 modern halls for rent for all occasions,” for a decade. In 1987 it became a singles dance space on Saturdays, but “no blue denim jeans” where allowed to be worn. In 1988, it opened as a sports bar and had Single’s Saturdays. In 1996, it separated into two spaces, one named Memory Lane and Club Nostalgia upstairs.", "1997 was when the bar officially became a Gay space.  In 1998 it changed over to Frankie’s again but stayed a Gay bar. In 1999, the upstairs was called Plum Cooley’s. On Wednesdays M.C.C met and there was Euchre nights. Fridays and Sundays was Karaoke. The space had pool tables and a shuffleboard area.", "June Willier first worked there when it first opened as Franky’s in 1999 until the space closed in 2005.", "In 2000, the name changed to the Complex bar on the upper floor. It was owned by Robert Sarra and David Ruxton. The power couple did some renovations on the place with a new light system and a video bar.  As part of their new look, they even started a free newsletter called the Complex Times, edited by D. S. Watts. The newsletter didn’t last very long and was mostly filled with ads and some short texts.  In 2000 They also hosted Pride events and was the final stop for the pride march.  During pride week they had a barbeque, Dance party, a Tea Dance, Karaoke contest, White Party, and a drag show that starred April Summers and LululaMore.   They opened the first floor a few months later. The main floor had a glass garage door which was open during the spring and summer months. They had a full menu. They even leased a parking area close to the bar with security. The Complex hosted Pride for many years until is closer.", "The Complex closed in 2005. The Complex was the last large scale Gay club in Windsor. After that there were other bars but much smaller is size and was a more basic area to hang out and not a huge dance space. The space was closed for Gay clientele forever and the space stayed vacant for a while until it was revamped into individual store fronts with varied stores using it today including a dance studio."], "timeline": null, "image": null}