{"id": "gd", "url": [{"path": "/photos/gd1.png", "type": "image", "imageAlt": "A pink poster for a Gay Dance party with illustrations of a cherub and two same-sex couples looking at each other with hearts behind them"}, {"path": "/photos/gd2.png", "type": "image", "imageAlt": "An orange poster for a Gay Costume Dance party with an illustration of 4 men in sailor, mouse, clown, and bridal drag linking arms"}, {"path": "/photos/gd3.png", "type": "image", "imageAlt": "A pink poster for a Gay Dance party with illustrations of feminine faces inside of two female gender glyphs, and masculine faces inside of two male gender glyphs"}, {"path": "/photos/gd4.jpg", "type": "image", "imageAlt": "A chartreuse poster for a Gay Dance party with an illustration of two women dancing together and two men dancing together"}], "description": ["The first big public event for the Windsor Gay Unity (WGU) was a community dance called  “Gay Dance”, on February 9, 1973. This dance took place at the Alumni Lounge of the University Centre. It was well attended, and there were reportedly no issues from the guests. Unfortunately however, three uninvited straight men came up from a pub downstairs to harass the participants. The men were at the entrance and saw Jim Davies in skag drag. They were told that they were not welcome at the dance, and in response to this rejection, they attacked the doorman. Others got involved to support the person at the door, and a small fight broke out. Paramedics and police were called.", "The 1973 event was covered internationally in gay magazines and newsletters. This unfortunate homophobic attack galvanized WGU to have more dances, have more public relations initiatives, and make sure they had a proper police presence at their events. The dances became a large social centre for the group. The Windsor community at the time had to go to Detroit to attend an official gay bar, as there were only “gay-friendly” Windsor bars on certain days, and other Windsor bars that were tolerant as long as no one was “too out” at the bar. Windsor also had a long history of having gay house parties, but nothing that was officially marked as gay to the public.", "In the first ten months of WGU's existence, they had sponsored six dances, which were all volunteer-run. One volunteer was Sandy Miller, who remembers the dances as generally having between 30 and 50 people attending. The price was reasonable as they simply wanted to cover the cost of the dance. Normally, the women would leave early, around 10:00 - 11:00 p.m., and the men would stay until closing around 1:00 a.m. There were 50/50 raffles held to pay for the space, and deejays would play current music. These dances got so popular that people from Chatham, Walpole Island, and even the United States would often attend.", "These events are regarded as an important part of the social element that WGU used to create a community, lasting from 1973 - 1979. They were the first public examples of LGBT gatherings in the area. The Electricians Hall dances took place from 1975 - 1977, and were very popular until Windsor's first gay bar eventually opened."], "image": "/photos/gd1.png"}