{"id": "gd", "url": null, "description": ["The first big public event for the Windsor Gay Unity (WGU) was a community dance called  “Gay Dance.” This happened on February 9, 1973. The dance took place at the Alumni Lounge of the University Centre. It was well attended, and there were no issues from the guests. But unfortunately, three uninvited straight men came up from a pub downstairs to harass the participants.", "The men were at the entrance and saw Jim Davies in skag drag. They were told that they were not welcome at the dance, and in response to this rejection, they attacked the door man. Others got involved to support the person at the door, and a small fight began. An ambulance and the police were called.", "The 1973 event was covered internationally though Gay magazines and newsletters. The unfortunate homophobic attack galvanized WGU to have more dances, have more public relations initiatives, and make sure they had a proper police presence at their events.", "The dances became a large social centre for the group. The Windsor community, at the time, had to go to Detroit to attend an official Gay bar. There were only “Gay friendly” Windsor bars on certain days and Windsor bars that were tolerant, as long as no one was “too out” at the bar. Windsor also had a long history of having Gay house parties, but nothing that was officially Gay to the public.", "By the first 10 months of WGU's existence, they had sponsored six dances, which were volunteer run. One volunteer was Sandy Miller, who remembers the dances as having between 30 and 50 people attending. The price was reasonable as they simply wanted to cover the cost of the dance.", "Normally, the women left early around 10:00 - 11:00 p.m., and the men stayed until closing at 1:00 a.m. There were 50/50 raffles to pay for the space, and the music was the music of the day with a deejay. The dances got so popular that people from Chatham, Walpole Island, and even the States attended.", "The events were an important part of the social element that WGU used to create a community, and the dances lasted from 1973 to 1979. These “Gay Dances” were the first public examples LGBT gatherings in our area.", "The Electricians Hall dances were from 1975 to 1977. They were very popular until Windsor's first Gay bar opened."], "image": null}