{"id": "hh", "url": null, "description": ["House parties were considered the safest method to get together before the 1970s. It was normally done by word of mouth. One of the most difficult issues with the house party was to figure out how to get invited to them. One method was for people who owned their own businesses such as salons and design firms to create safe environments for Queer people to socialize.  Dani Bobb told me you found out about these parties by personally going to these businesses and letting the owners get to know you. Another method was to get involved in local cultural groups. There were many different cliques that hosted parties such as the Hairdresser or Pharmacy cliques. If Gay men didn’t belong to certain groups of social strata, they had difficulty finding a group in which they felt welcome.  For many it was only the middle- or upper-class Queers’ method of socialization. The house parties were basically a Drink and Talk environment. The house parties had varied affairs, from backyard pool parties to low key gatherings, to costume events that included going in drag. Dani Bobb told me that they were normally Wednesday afternoons when the Doctor offices and lawyer offices were closed.", "There were well known House parties at this location. Dani Bobb told me that these parties happened from the 1950s and up to the 1970s. The building had a nickname from the Queer community, “Homo Heights.” It included prominent lawyers, doctors, designers, photographers, a gold shop owner, and a former Mayor of Windsor.  It is quite possible that this was a Queer space even before the 1950s.  In the 1920s there was the Business and Professional Woman's Club.  The club lasted till the early 1990s. One of their advertised events in 1934 was a social evening of reading by Miss Eleanor Barteaux, a librarian at the Windsor Public Library who spoke about “Four Saints in Three Acts” by Gertrude Stein, and the play Salome by Oscar Wilde.  Both well-known Queer writers during that period. The Windsor Star had advertisements in the 1940s for a businessmen’s lunch set up which included special Sunday dinners and private parties.", "Some of the groups that existed in the past, we cannot prove they were Queer or Queer friendly spaces, but we know of some known Queer people who were involved in some of these groups. When we look at these historical cultural groups, we can only guess on the Queer connection. No one at that time would have been “out.”", "Another possibility is looking at the people who never married and the type of company they kept. Anne Hume is a good example of that. She never married. She was head librarian at Walkerville public library starting in 1920. In 1957 she retired as the chief librarian in Windsor. She was founder of the Arts and Letters Club, founding member of Windsor Art Association, served on the executive of the local Council of Women, charter member of the University Women’s Club of Windsor, and first president of the Zonta Club of Windsor. She died in 1966 under the care of her sister in Campbellford.", "Peter K. Ryan hosted house parties in the 1960s at 691 Chatham Street West. Ryan was a well-known interior designer in Windsor. He graduated from Assumption University in 1950s and in 1968 was the first person from Windsor to get accepted as a corporate member of the worldwide American Institute of Interior Designers.  He had an antique shop which had furniture and other collectables. He was part of the original steering committee of Willistead Manor.  He was also a fundraiser for the Art Gallery as well as a donator of artwork.  He never married and died in 1998. His partner, in the obituary states it “Dear Friend” for 28 years, Harry Hiemstra continued the store until it closed in 2006. Mel Young remembers his parties who lived in the same building as the parties and Ryan was his cousin. He told me they went on about every three months.", "Another example is in 1968 when the Music, Literature and Art Club met on Mondays at “homo heights.” Miss Jeanette McLaren with Miss Ruth McLaren were the co-hostess. The group advertised in the newspaper and always had Miss in front of each person’s name who hosted. Miss Ruth McLaren in 1970 celebrated an anniversary of the Women’s Club of the Canadian Federation of University Women. There is a photo of her with Miss Clair Coughlin beside her. There is no proof of their sexual orientation, just simply they lived at Windsor Court, never married, and worked on women’s causes.", "One early house party clique that there is no debate about was in Leamington. It was hosted by Don Lockery (1907-1988).", "Don was an American born in Connecticut.  His father moved to Detroit to work in the automotive industry.  Don’s parents retired to a lakefront property in Leamington. Don continued living with them but worked all his life in Detroit. Don started to do house parties at his parents Seacliff Drive house.   Many of his house parties was mostly American and the Canadians who they knew. But they were known in the Gay community in Windsor at the time.", "Sandy Morgan (1931-2002) moved to Leamington from Montreal in 1956. Which he was walking along the beach he saw one of the cottages very near the beach had burned down and Don was surveying the damage and beginning a cleanup.   They started up a conversation and they seemed to hit it off.  A few evenings later, he was again walking along the beach and Don was again cleaning up the debris.  They chatted and then he invited him up to his parents’ house for tea.  Afterwards he offered to drive Sandy to his lodgings.   Shortly thereafter, he was invited to move into his house.  They lived together for 33 years before Don died of cancer. The two of them continued the house parties. Most of the people who attended were from professional or business backgrounds.  There were several executives from Ford, doctors, and accountants.   One man owned and operated an industrial/commercial cleaning business.   Most of the people were from the greater Detroit area but eventually there were also several Canadian couples. The house parties did not play any music except as background for meals.", "Most of the time the guests were swimming, sunbathing, drinking and engaging in small talk.  There was a lot of laughter. They had BBQs near the beach.  After dark some guys would go swimming in the nude.", "In 2012, Sandy met Dennis Dowker and in 2016 they got married and lived together until Sandy’s death in 2020."], "timeline": null, "image": null}