{"id": "hh", "url": [{"path": "/photos/hh1.png", "type": "image", "imageAlt": "A newspaper clipping advertising a business men's Sunday lunch event at the Windsor Court Dining Room"}, {"path": "/photos/hh2.jpg", "type": "image", "imageAlt": "A black and white photo of two men in tank tops and shorts laying across some waterside rocks"}, {"path": "/photos/hh3.jpg", "type": "image", "imageAlt": "Two older gentlemen cutting into a birthday cake together"}, {"path": "/photos/hh4.jpg", "type": "image", "imageAlt": "A black and white photo of two men at the beach laying on their stomachs under an umbrella"}, {"path": "/photos/hh5.jpg", "type": "image", "imageAlt": "A black and white photo of five men laughing together"}, {"path": "/photos/hh6.png", "type": "image", "imageAlt": "A photo from May 21, 2016 of two older gentlemen in glasses smiling for the camera"}], "description": ["House parties were considered the safest method to get together before the 1970s, normally organized by word-of-mouth. One of the most difficult issues with the house party was to figure out how to get invited to them. One method was for people who owned their own businesses, such as salons and design firms, to create safe environments for Queer people to socialize. Dani Bobb, who was around at the time, reports that people found out about these parties by personally going to these businesses and letting the owners get to know you. Another method was to get involved in local cultural groups, but there were many different ones that hosted parties, including the hairdresser and pharmacy cliques of the time. If gay men didn't belong to certain groups of social strata, they would have difficulty finding a group in which they felt welcome. For many, it was only the middle- or upper-class queers who were able to utilize this method of socialization. The house parties were varied affairs, from backyard pool parties to low key gatherings, to costume events that included going in drag. Dani also stated that they were normally Wednesday afternoons, when the doctor's offices and lawyer's offices were usually closed.", "This location hosted several of these house parties from the 1950s - 1970s. The building was called the “Homo Heights” by members of the queer community. Prominent lawyers, doctors, designers, photographers, a gold shop owner, and a former Mayor of Windsor were included in these events.", "It's quite possible however that this was a queer space even prior the 1950s. In the 1920s for instance, the Business and Professional Woman's Club was founded, which would last until the early 1990s. One of their advertised events in 1934 was a social evening of reading by Miss Eleanor Barteaux, a librarian at the Windsor Public Library, who spoke about “Four Saints in Three Acts” by Gertrude Stein, and the play ”Salome” by Oscar Wilde, who were both well-known queer writers during that period. The Windsor Star also had advertisements in the 1940s for a businessmen's lunch which included special Sunday dinners and private parties. While we cannot prove that some of the groups that existed in the past were queer, or even queer-friendly spaces, we know of some known queer people who were involved. When we look at these historical cultural groups, we can only assume the queer connection, as relatively no one at that time would have been “out” as we understand it today.", "Peter K. Ryan hosted house parties in the 1960s at 691 Chatham Street West. Ryan was a well-known interior designer in Windsor who graduated from Assumption University in the 1950s, and in 1968, was the first person from Windsor to get accepted as a corporate member of the worldwide American Institute of Interior Designers. He had an antique shop which sold furniture and other collectables. He was part of the original steering committee of Willistead Manor, and was also a fundraiser for the Art Gallery, and a donor of artwork. He never married and died in 1998. His partner, Harry Hiemstra, who the obituary states was a “dear friend” of 28 years, continued the store until it closed in 2006. Mel Young who lived in the same building, remembers his parties, and Ryan was his cousin. He told me they went on about every three months.", "The Music, Literature and Art Club met on Mondays at the spot known as “Homo Heights”. Miss Jeanette McLaren and Miss Ruth McLaren were the co-hostesses. This group advertised in the newspaper and always had the honourific “Miss“ in front of each person's name who hosted. Miss Ruth McLaren celebrated an anniversary of the Women's Club of the Canadian Federation of University Women in 1970, and there is a photo of her with Miss Clair Coughlin. There is no proof of their sexual orientation, just simply that they lived at Windsor Court, never married, and worked on women's causes.", "One early house party clique that there is no debate about was in Leamington. These parties were hosted by Don Lockery (1907-1988), an American born in Connecticut. His father had moved to Detroit to work in the automotive industry, and Don's parents retired to a lakefront property in Leamington. Don continued living with them but worked all his life in Detroit. Don originally started to host house parties at his parents Seacliff Drive house. Many of these parties were mostly attended by Americans and the Canadians they invited personally, but they were also known to the gay community in Windsor at the time.", "Sandy Morgan (1931-2002) moved to Leamington from Montreal in 1956. He was walking along the beach once when he saw one of the cottages very near the beach had burned down and Don was surveying the damage and beginning a cleanup. The two of them started up a conversation and they hit it off. A few evenings later, he was again walking along the beach and Don was once again cleaning up the debris. They chatted once more and Don invited him up to his parents' house for tea. Afterwards, he offered to drive Sandy to his lodgings, before later being invited to move into his house. They lived, and hosted the house parties together, for 33 years before Don eventually died of cancer. Most of the people who attended were from professional or business backgrounds, apparently including several executives from Ford, as well as doctors, accountants, and an owner of a industrial/commercial cleaning business. Most of the people who attended were from the greater Detroit area but eventually there were also several Canadian couples. These parties did not play any music except as background for meals. Most of the time, the guests were swimming, sunbathing, drinking, and engaging in small talk. They had BBQs near the beach, and reportedly after dark, some guys would go swimming in the nude. In 2012, Sandy met Dennis Dowker, and in 2016 they got married and lived together until Sandy's death in 2020."], "timeline": null, "image": "/photos/hh1.png"}