{"id": "ht", "url": [{"path": "/photos/ht.jpeg", "type": "image", "imageAlt": "The Happy Tap logo"}], "description": ["This building was erected in 1920 and designed by architect Stanley F. Walker. The first owner was Joseph Reycraft who opened the Reycraft's Store, specializing in dry goods, menswear, and ladieswear. In the 1930s, it was the place for car sales, and then in the 1960s, it became a bar. Later known as Pero's Hotel (House), a country music establishment from 1976 - 1981. Pero's at one point even had a mechanical bull. In 1981, it changed its name to the Jerseys Tavern and got a license for female adult dancers. It was a couple years later, in 1983, that it changed its name to the Happy Tap, but it wasn't a gay bar yet at that time, but rather was still advertised as a country and western bar. It promoted itself in the Windsor Star as hosting music every Wednesday, Friday, and Saturday. Later switching to live bands, such as the Greg Allen Band, Tommy Jackson's Gold Country, Sundown, Tag Team, and Bittersweet on the other days. In January of 1984, it was advertised as being under a “New Name, New Owners, New Atmosphere”, which included the Detroit band Janglers and music from the 1950s and 1960s, as well as country music. This was also the year the logo that was used for a decade appeared. But it still seemed to be a straight bar primarily. In September of that same year, a 23-year-old woman and a 24-year-old woman were both stabbed in front of the bar.", "In 1985, the bar continued hosting different bands including Touch, Cash, Sideman, Lifeline, and Joe Harley Band. They also sponsored a team in the Rose City Fastball league called the East Side Happy Tap. The team made it to the semi-finals in 1985 losing to the Boow's team. In September of that year, they advertised for female wet t-shirt contestants.", "Also in 1985 however, there was another attack at the bar which could have had homophobic motivations. A 52-year-old man was beaten and robbed after he met a 29-year-old man at the Happy Tap. Supposedly, the bar ran out of beer and the two were sitting together, at which point he decided to “invite his companion back to his Ouellette Ave. apartment” to drink more beer.  While they were at the apartment, the 29-year-old hit the 52-year-old in the eye and demanded money, of which he got about $40.", "The last advertisement that included a bar under the straight understanding was in November of 1985. It wasn't until the January 15th, 1986, that an issue of the Cruise magazine (the Detroit gay scene publication of the time) announced the opening of the Happy Tap as gay bar, with a picture that included Dick Casey and John Jordan (the straight owner). During his career, he owned Antonelli's Radio Café in 1985, and operated the “The Latin Quarter” (a straight strip bar). He also oversaw the Radio Tavern and the Shawnee in Tecumseh.", "In 1986, the Happy Tap joined the Detroit Bar Guild which was a gay bar association. At that point, Dick Casey had run three gay bars: the Ritz, Louie's, and the most well-known, which was the Safari Inn. Out of the three, Safari was attracted the most individuals from Detroit.", "The Happy Tap had dancing six nights a week at that time, and the format of JP's changed to nude tabletop dancers, getting rid of their drag shows. The Tap was able to fill in that gap, and on their one-year anniversary on January 28th, they had Samantha Stevens, Ashley Martin, Tabatha Desault, Madame Deevine, Missy Watt, Fran, and Calvin Cats perform. The bar also had euchre nights on Wednesdays. They really tried to connect with the Detroit crowd, and in that same year, they even had an AIDS Committee fundraiser with employees from Happy Tap playing softball against the Detroit Gold Coast Saloon.", "The Happy Tap then became a target of anti-gay hate in October 1986 when two Molotov cocktails were thrown into both the front and back entrance of the bar. Luckily there were no serious injuries. This act could have potentially been devastating like the Upstairs Lounge attack on June 1973 in New Orleans where 32 people died. The damage to the bar was around $200.", "Marie-France Jean, who worked at the Tap in the late 1980s and early 1990s, remembers when in 1987, a lesbian bar opened in the basement of the Tap. It was called “Maybes”. She joked that they came up with the name based on the concept “Maybe she is... Maybe she isn't”. Jean helped create the new logo, which was a unicorn with the slogan “Bitchen-Alternative-Music”. She was the main bartender for the women and remembers how much fun the place was for the lesbian community at that time. She also teased that many of the women who went were all playing baseball together. Several women would first go to the bars in Detroit and then would come back to Windsor and spend time in the basement at the Tap. The bar didn't last long, however, and it wasn't because of interest. Jean says she came to work one morning and was told by Casey that she would be working upstairs because the basement was now a male adult dance space. There was no heads up, it just changed overnight, and it seemed it was financially motivated.", "For over two decades, the Happy Tap would be the focus of the male “Windsor Ballet”. In 1986, they advertised in Cruise magazine with French dancers from Montreal being all nude. There is documentation in the Windsor Star that in 1988 the city granted the bar a strip license. One of the advantages that Tap had over JP's was its multiple levels. They would have disco dancing on the main floor and the nude dancers in the basement. They also competed with JP's by having no cover charge every night, which JP's also did, except on Tuesdays.", "After the closing of JP's in 1988, the Happy Tap became the main gay bar for the community, though other gay bars would open and close during that time. It wasn't until 2000 that another gay bar would last more than a year: the Complex at 634 Chilver Road, which was open for 5 years.", "The Tap hosted many events in the 1990s including fundraisers for the AIDS Committee of Windsor and was also one of the hosts for Pride. In 1990, the bar got a license to change their classification from a lounge to a dining lounge. In 1992, there was a drag competition with Miss Gay Happy Tap being won by Serena Garret (Gary Menard). In 1993, the Happy Tap became part of the Windsor Pride festivities which included a Miss Lesbian/Gay Pride Day, also won by Serena Garret. Drag shows were always part of the gay bar scene in Windsor and the Happy Tap was no different. In the 1990s, they were having drag shows on Thursdays and at times on Tuesdays, that included Vicki Charles, Samantha Stevens, Ashley Martin, Tabatha Desault, Madame Deevine, Missy Watt, Fran, Calvin Cats, Koo Saba with Serena, and Amanda Collins.  The bar would have both Canadian and American drag performers at the bar.", "There were many bartenders who came and went through the Tap. One of them was Mary, who was a straight immigrant woman from Poland, who reportedly kept order in the bar and even had a baseball bat she would use if needed. June Willier was also an important part of the Happy Tap. She was a Cree Indigenous trans woman who first went to the Tap when she moved to Windsor from Alberta in 1989. She was born in 1962, and came out as trans as a teenager, even attempting to go to her prom in a dress. She was told by her mother at the time to never come back if she wore a dress. She then met a man from Windsor and ended up following him to the area. She found out about the Tap and the club was the only place she felt safe to be herself, even though she would get harassed by the gay men at the bar. She has said that they were very jealous of her partner and would say things like “I would wear a dress if I could get a hot man like that. After several altercations, Casey ultimately ended up barring her and her partner from the club. She decided to meet with Casey and told him she would like to get a job at the bar, telling him she would stop drinking and go to school to get her bartending license before coming back to talk to him. She ultimately went to St. Clair and did exactly that. Once she graduated, Casey employed her, and this was the start of the career she would continue to do at many gay bars in the city. She ended up bartending for the club for 2 years starting around 1992, and was part of the Pride Festivals that Windsor Pride did in the early days. She would still have to deal with anti-trans issues from the patrons though; gay men would talk about her and make comments about her behind her back. As an employee, she used jokes and interactions to change the tension. At one point, there was a group of lesbians who went to Casey to complain that they did not want her to use the women's washroom. Casey discussed it with her and she said she didn't feel safe to go in the men's washroom. Casey decided to talk to the women who had the problem. He told them that Willier would be using the women's washroom and if they had any issue with it, they should simply go somewhere else. She always bartended on the main floor, and wasn't allowed in the basement because only men would be allowed to go down and watch the dancers. This rule was broken once when the musical group the Pointer Sisters came into town and wanted to watch the dancers. June ended up serving the group the whole night, and she remembers that they were wonderful and very kind. They gave her an autographed picture of themselves and left a $150 tip.", "The Happy Tap, especially after JP's closed in 1988, was one of the most important safe spaces for queer people in Windsor to go to, but leaving the bar was another issue. Willier and others had issues simply trying to leave the bar at night, having to deal with teenagers who would wait outside the bar to attack her and others, as well as run-ins with the police. They would demand identification, and if she didn't have it, they would arrest her. She told me that she is still harassed today, by the same police officers, out of uniform. She would walk to the grocery store and the police would use her deadname and tell her that her kind is not welcome in Windsor. Willier ultimately left the Tap after 2 years because she wanted to get away from the drugs, hustling, and booze of the bar. She ended up working at the CanAm Friendship Centre for a few years, but her gay bartending years continued, and she ended up working at other gay bars, such as Silhouettes at 1880 Wyandotte East, Club Nostalgia, Franky's, Plum Coolies, and the Complex on 634 Chilver Road.", "In 1993, the Tap once again had live country bands such as Ray's Rambling Rhythm, and in 1994, female adult dancers were introduced again. In 1996, the bar imported well-known drag queens from Detroit and Florida such as Leigh Shannon and April Summers. The manager at that time was Joe Ganci.", "The bar was charged twice with “keeping a common gaming house” in both 1993 and 1998. The bar was allowed to have video gaming machines if they didn't pay out any money. The courts argued that bartenders gave patrons $25 after racking up 500 points on the machines. Two bartenders and Jorden were charged but were later dropped.", "By this time, the Tap had a huge reputation. Americans flocked to the bar and were even given their toll back by bartenders. In 1997, the bar had a “Staff Turnabout Show” where Mona and other staff did drag for a benefit for AIDS Walk Canada. Willier told me she also met one of her best friends during her time at the bar. There weren't many trans people she knew at that time, but there was one drag performer called Missy who performed a great deal at the bar. One day after a performance, Missy came up to Willier and said to her “I heard you are like me?”. Her response to Missy was “honey, no one is like you!” They became fast friends, and Willier would help Missy with her makeup, etc. Unfortunately, Missy was HIV-positive and gave up her dream of being a woman. At that point, many members of the trans community felt that getting gender-affirming surgery was the only way you could legitimately be your true self. In Canada, if you were HIV-positive, you got rejected from being able to get the surgery. Missy later died in 1994, at 34-years-old, of complications related to AIDS. Willier worked with Missy's sister to make sure she was cremated in full makeup and her favourite dress.", "At the end of 1997, Happy Tap came under new management. They did renovations, advertising “two floors of excitement, with hot tunes on the man floor, and the best in male entertainment on our lower level”. In 1999, the Happy Tap was sold, and now just called “the Tap”. On March 25th, 2001, the Tap had a Miss New Tap pageant, and the top prize was $500. That same year, they had the Erotic Dance of the Year competition.", "The Tap closed as a gay bar in 2002 and switched back to a straight strip bar. From 2010 - 2013, it was operated under the name “Legends 2012” run by Roger Samudio. In 2016, it returned to its roots as a gentlemen's club under the name “The Playhouse”."], "timeline": {"header": "Happy Tap Drag Competition Winners", "list": ["1992: Miss Gay Happy Tap was Serena Garret (Gary Menard)", "1993: Miss Lesbian/Gay Pride Day was Serena Garret", "1994: Miss Happy Tap Amanda Collins", "1996: Miss Happy Tap Duchess of Windsor Karen White (Robert Henry)", "1997: Miss Happy Tap Diva and DiAngela Shannon"]}, "image": "/photos/ht.jpeg"}