{"id": "ht", "url": null, "description": ["The building was erected in 1920 and designed by architect Stanley F. Walker. The first owner was Joseph Reycraft who opened the “Reycraft’s Store specialized in Dry goods, Men’s and Ladies wear.” In the 1930s it was the place for car sales. Then in the 1960s it became an actual bar. Pero’s Hotel (House) Country music bar from 1976 -1981. Peros Tavern at one point even had a Mechanical bull. In 1981 it changed its name to the Jerseys’ Tavern and got a license for female adult dancers. It was in 1983 that it changed its name to the Happy Tap, but it wasn’t a Gay bar yet. It was first advertised under the Happy Tap name as a country and western bar. It promoted itself in the Windsor Star as hosting western music every Wednesday, Friday, and Saturday.  Then switching to live bands such as Greg Allen Band, Tommy Jackson’s Gold Country, Sundown, Tag Team, and Bittersweet on the other days.", "January of 1984 it was under a “New Name, New Owners, New Atmosphere,” which include the Detroit band Janglers and music from the 1950s’, 1960’s and Country. Only proper “attire” was allowed. This was also the year the logo that was used for a decade appeared. But it still seemed to be straight. It still had the same bands from 1983 as well as some newer groups from Detroit like “Bonnie and the Working Girls.”  In September of that same year the place seemed to get more dangerous with a stabbing of a 23-year-old woman and the stabbing 24-year-old women in front of the bar. 1985 the bar continued with hosting different bands including Touch, Cash, Sideman, Lifeline, and Joe Harley Band. They sponsored a team in the Rose City Fastball league called the East Side-Happy Tap. The team made it to the semi-finals in 1985 losing to the Boow’s team.  In September 1985 they advertised for female wet t-shirt contestants.", "In March of 1985 there was another attack at the bar. This time seemed very Queer. A 52-year-old man was beaten and robbed after he met a 29-year-old man at the Happy Tap. Supposedly, the bar ran out of beer and the two were sitting together and decided to “invite his companion back to his Ouellette Ave apartment” to drink more beer.  While they were at the apartment the 29-year-old hit the 52-year-old in the eye and demanded money, which he got about $40.00.", "The last advertisement that included a bar under the straight understanding was in November of 1985.  It wasn’t till the January 15th, 1986, issue of the Cruise magazine (Detroit Gay scene magazine) announced the opening of the Happy Tap as a Gay bar with a picture that included Dick Casey and John Jordan. Jordan was the owner and straight.  During his carrier he owned Antonelli’s Radio Café in 1985 and operated the “The Latin Quarter” which was a straight strip bar. He also oversaw the Radio Tavern and the Shawnee in Tecumseh.", "In 1986, the Happy Tap joined the Detroit Bar Guild which was Gay bar association. The bar’s early advertisements including that Dick Casey oversaw the bar. At that point Casey had run three Gay bars. The Ritz, Louie’s, and the most well-known Safari Inn. Out of the three, Safari was able to really get the Detroit crowd to the bar.", "The Happy Tap had dancing six nights a week. At that point the format of JP’s changed to nude tabletop Dancers and got rid of their drag shows. The Tap filled in that gap. On their one-year anniversary January 28th, they had Samantha Stevens, Ashley Martin, Tabatha Desault, Madame Deevine, Missy Watt, Fran and Calvin Cats perform. The bar even had Euchre nights on Wednesdays.", "The bar really tried to connect with the Detroit crowd. In the same year, they even had an AIDS Committee fundraiser when employees from Happy Tap were playing softball against the Detroit Gold Coast Saloon. That same year the Happy Tap was also a target of anti-Gay hate in October 1986 when two Molotov cocktails were thrown into both the front and back entrance of the bar. Luckily there were no serious injuries. This act could have potentially been devastating like the Upstairs Lounge attack on June 1973 in New Orleans where Thirty-two people died.  The damage to the bar was around $200.00.", "Marie-France Jean who worked at the Tap in the late 1980’s to early 1990s remembers when in 1987 a lesbian bar opened in the basement in the Tap. It was called “Maybes.” She joked that they came up with the name based on the concept “Maybe she is…Maybe she isn’t.” She helped create the new logo which was a unicorn with the slogan “Bitchen-Alternative-Music.” They repainted the basement and it opened. Jean was the main bartender for the woman and remembers how much fun the place was for the lesbian community. She also teased that many of the women who went were all playing baseball together.  Several women would first go to the bars in Detroit and then would come back to Windsor and spend time in the basement at the Tap.  The bar didn’t last long, and it wasn’t because of interest. Jean came to work one morning and was told by Casey that she would be working upstairs because the basement was now a male adult dance space. There were no heads up, it just changed overnight. It was all about making money. And for over two decades the Happy Tap would be the focus of male “Windsor Ballet.”", "In 1986 they advertised in Cruise magazine with French dancers from Montreal being all nude.  There is documentation in the Windsor Star that in 1988 the city granted the bar a strip license and immediately there was advertising for Male Dancers.   One of the advantages that Tap had over JP’s was its multi levels. They would have disco dancing on the main floor and the nude dancers in the basement. They also competed with JP’s by offering no cover every night which JP’s did except on Tuesdays.", "After the closing of JP’s in 1988, the Happy Tap became the main Gay bar for the community. Other Gay bars would open and close during that time. It wasn’t till 2000 that another Gay bar would last more than a year. The Complex at 634 Chilver Road was open for 5 years.", "The Tap hosted many events in the 1990s including fundraisers for the AIDS Committee of Windsor and was also one of the hosts for Pride. In 1990 the bar got a license to change their classification from a Lounge to a Dining Lounge. In 1992, there was a drag competition with Miss Gay Happy Tap who was won by was Serena Garret (Gary Menard). In 1993, the Happy Tap became part of the Windsor Pride festivities which included a Miss Lesbian/Gay Pride Day won by Serena Garret.", "Drag shows were always part of the Gay bar scene in Windsor and the Happy Tap was no different. In the 1990s they were having drag shows on Thursdays and at times on Tuesdays, that included Vicki Charles, Samantha Stevens, Ashley Martin, Tabatha Desault, Madame Deevine, Missy Watt, Fran, Calvin Cats, Koo Saba with Serena, and Amanda Collins.  The bar would have both Canadian and American drag performers at the bar. Wednesdays were Bingo, as well as Monday and Thursday Karaoke. It also had Drag competitions with the Winners listed below.", "There were many bartenders who came and went through the Tap. One of the stable people was Mary, who was a straight immigrant woman from Poland. She kept order in the bar and even had a baseball bat she would use if needed. June Willier was also an important edition of Happy Tap. Willier is a Cree indigenous Trans woman who first went to the Tap when she moved to Windsor from Alberta in 1989. She was born in 1962 and was out as Trans as a teenager. She even tried to go to her prom in a dress. She was told by her mother to never come back if she wore a dress. She met a man from Windsor and ended up following him to this area. At that time, she told me that she would drink a great deal. She found out about the Tap and the club was the only place she felt safe to be herself. Even though she would get harassed by the Gay men at the bar. She told me that they were very jealous of her partner and would say things like “I would wear a dress if I could get a hot man like that. She would get into verbal confrontations with them. Casey ended up barring her and her partner from the club. She decided to meet with Casey and told him she would like to get a job at the bar. She said she would stop drinking and go to school to get her bartending license and come back and talk to him. She went to St. Clair and did exactly what she promised. Once she graduated, she went back to Casey, and Casey employed her. This was the start of the carrier she would continue to do at many Gay bars in the city.  She ended up bartending for the club for two years starting around 1992 including being part of the Pride Festivals that Windsor Pride did in the early days. She would still have to deal with anti-Trans issues from the patrons though. Gay men would talk about her and make comments about her behind her back. As an employee she used jokes and interactions to change the tension.  At one point there was a group of lesbians who went to Casey to complain that they did not want her to use the female washroom. Casey discussed it with her. She said she didn’t feel safe to go in the male washroom. Casey decided to talk to the women who had the problem. He told them that Willier would be using the women’s washroom and if they had any issue with it, they should simply go somewhere else.", "Willier always bartended on the main floor. She wasn’t allowed in the basement because only men would be allowed to go down and watch the dancers. This rule was broken once when the musical group the Pointer Sisters came into town and wanted to watch the dancers. June ended up serving the group the whole night. She remembers that they were wonderful and very kind. They gave her an autographed picture of themselves and left a $150 tip.", "The Happy Tap, especially after JP’s closed in 1988 was one of the most important safe spaces for Queer people in Windsor to go to. But leaving the bar was another issue. Willier told me that many people including herself had issues simply trying to leave the bar at night. She would have to deal with teenagers who would wait outside the bar to attack her and others. Willier would also have many run ins with the police. They would demand identification and if she didn’t have it, they would arrest her.  The Happy Tap also had a bunch of robberies from the car parked in the parking lot. They told the police, but they said they could not help unless they paid for the police as a security officer to stay there during the time the bar was open. Which they did. They paid for weekends.", "Police would make sure people got into their cars safely. She told me that she is still harassed today, by the same police officers, out of uniform. She would walk to the grocery store and the police would use her dead name. She would tell them her name and leave her alone. They would respond that her kind is not welcome in Windsor.  Willier left the Tap after two years because she wanted to get away from the drugs, hustling and booze of the bar. She ended up working at the CanAm Friendship Centre for a few years. But her Gay bartending years continued. She ended up working at other Gay bars such as Silhouettes at 1880 Wyandotte East, Club Nostalgia, Franky’s, Plum Collies, and the Complex on 634 Chilver Road. The Complex was her favourite bar to work at. She had complete control and overseed the upstairs and her old boss Casey ending up also working there, overseeing and being at the door at the downstairs. She worked there until it closed.", "In 1993, the Tap once again had live country bands such as Ray’s Rambling Rhythm and in 1994 Female adult dancers were introduced again. In 1996 the bar imported well known Drag Queens from Detroit and Florida such as Leigh Shannon, and April Summers. The manager at that time was Joe Ganci.", "The bar was charged twice with “keeping a common gaming house” in 1993 and 1998. The bar was allowed to have video gaming machines if they didn’t pay out any money. The courts argued that bartenders gave patrons $25.00 after racking up 500 points on the machines. Two bartenders and Jorden were charged but were later dropped.", "By this time The Tap had a huge international reputation. American flocked to the bar and Americans were even given their toll back from the bar.", "In 1997, the bar had a “Staff Turnabout Show” where Mona and other Staff did drag for a benefit for AIDS Walk Canada. Willier told me she also met one of her best friends during her time at the bar. She told me that there weren’t many Trans people she knew. But there was one drag performer called Missy who performed a great deal at the bar. One day after a performance Missy came up to Willier and said to her, “hey, I heard you are like me?” Her response to Missy was “Honey, no one is like you!” They became fast friends. Willier would help Missy with her make up etc. and helped her to try to not change into male clothing all the time when she left the bar. Willier told me that Missy was a great performer and a great friend. Unfortunately, Missy was HIV positive and gave up her dream of being a woman. At that point, the Trans community felt that getting gender affirming surgery was the only way you could legitimately be your true self. In Canada, if you were HIV positive you got rejected from able to get the surgery. Missy died in 1994 of complications related to AIDS. She was 34 years old.  Willier worked with Missy’s sister to make sure she was cremated in full make up and her favourite dress.", "At the end of 1997, Happy Tap came under new management. They did renovations to the two floors with “two floors of excitement, with hot tunes on the man floor, and the best in male entertainment on our lower level.”", "In 1999, the Happy Tap was sold and was now just called “The Tap.” On March 25th, 2001, the New Tap had a Miss New Tap pageant. First prize was $500.00. That same year they had the Erotic Dance of the Year competition.", "The Tap closed as a Gay bar in 2002 and switched back to a straight strip bar. Then opened again as “The Tap” in 2006 owned by Eddie An. In 2010 under the name “Legends 2012” run by Roger Samudio. Which lasted till 2013.  In 2016 it returned to its roots and once again as a straight strip club called “The Playhouse. Gentlemen’s Club.”"], "timeline": {"header": "Happy Tap Drag Competition Winners", "list": ["1992: Miss Gay Happy Tap was Serena Garret (Gary Menard)", "1993: Miss Lesbian/Gay Pride Day was Serena Garret", "1994: Miss Happy Tap Amanda Collins", "1996: Miss Happy Tap Duchess of Windsor Karen White (Robert Henry)", "1997: Miss Happy Tap Diva and DiAngela Shannon"]}, "image": null}