{"id": "jpd", "url": [{"path": "/photos/jpd1.png", "type": "image", "imageAlt": "An old photo of JP's Disco, a large white warehouse looking building, with the original signage still intact"}, {"path": "/photos/jpd2.png", "type": "image", "imageAlt": "A black and white photo of the hotel signage hanging above the entrance reading “West Side House”"}, {"path": "/photos/jpd3.png", "type": "image", "imageAlt": "A black and white photo of a construction vehicle tearing down JP's Disco"}, {"path": "/photos/jpd4.png", "type": "image", "imageAlt": "An old picture of four men with their arms around eachother behind a bar"}, {"path": "/photos/jpd5.png", "type": "image", "imageAlt": "Three men stounding around a bar, one wearing a shirt with the JP's logo on the front pocket"}, {"path": "/photos/jpd6.jpeg", "type": "image", "imageAlt": "Seven drag queens standing in a row in dresses and evening wear"}, {"path": "/photos/jpd7.jpeg", "type": "image", "imageAlt": "Two drag queens wearing tiaras smile into the camera"}, {"path": "/photos/jpd8.jpeg", "type": "image", "imageAlt": "A drag queen with curly red hair wears a tiara and smiles into the camera"}], "description": ["From 1912 - 1979, this was the spot of the West Side Hotel. It was a speakeasy during the prohibition period and became an “unofficial” lesbian bar from 1974 - 1978. In 1978, it was purchased by James Parent, but he soon sold it to Dr. Raymond Bluett (1945 - 1999). Dr. Bluett kept the name and turned it into one of the most important gay bars in Windsor for almost a decade.", "JP's Disco was open from 1980 - 1988.", "From the start, JP's advertised in the Michigan Cruise magazine starting in February of 1981. Over the years, they had many catchphrases in their advertisements, including: “Always Get Your Man”, “Visit Canada and See How Friendly We Can Be”, “A Thankful Canadian Will Take You a Long Way! JP's: Come Meet a Canadian”, “Only a River Comes Between Us”, “When Your Ship Comes In, JP's Is the Only Bar in Sight”, “You've Heard About Us… Now Experience Us”", "In 1983, it held the first Gay/Lesbian international celebration in North America, entitled “United for Freedom: Lesbian and Gay Freedom Day (Detroit/Windsor)“ and had a yearly competitions.", "By 1988, the party was over at JP's. Windsor has always had issues with sustaining more than one gay bar at a time. It was JP's turn to start losing money. The Happy Tap was just a better space with a main floor for dancing and drag shows and the basement for table dancers, JP's just couldn't compete anymore. Bluett ended up closing the bar and selling it to Tony Rea. At the time there was an upswing in developing of Condominiums downtown. McParland told me that Bluett was offered around a million dollars for the space. Bluett and McParland still had hope to open a new Gay bar and looked for other locations and almost bought one called the Chippewa house at 340 Bloomfield Road, but Bluett found out he was ill and that changed everything. After the bar closed Bluett moved to the States with his partner Bob Cohen. He died in 1999 of complications from AIDS at the age of 52."], "timeline": {"header": "Miss (and Mr.) Gay Windsor Winners", "list": ["1981: Vicki Charles (Gary Beaul) and Michael Horvack", "1982: Kitty O'Day (Sidney Beaudoin) and Reeve Curriere (known as Mr. JP's)", "1983: Tonya Wolfe (Et Bonato)", "1984: Dudaria Junn (Dominic Jun Haw Hock)"]}, "image": "/photos/623rdw1.png"}