{"id": "rh", "url": [{"path": "/photos/rh.png", "type": "image", "imageAlt": "A black and white photo of the sign of the Ritz Hotel"}], "description": ["There were two Ritz Hotels in Windsor at one point. George Spoiala owned both. He first purchased the Hotel across from the British American Hotel on Riverside Drive in the 1947. He then bought the Ambassador Hotel on 93 Riverside Drive in 1955.  He changed the name of Ambassador Hotel to the New Ritz Hotel. Throughout the hotels history it has focused on different ways to get new audiences.", "In 1959, Spoiala did an expansion of the Ritz property to include 98 Pitt Street which was the Towne House Hotel which was owned by Percy Zinberg from Royal Oak, Michigan. Before Spoiala bought the Towne House there were many issues with it, including robberies and fights. Between the New Ritz and the Town House Hotel there was the Fulford Motor Service owned by Norman and Nelson Fulford. But it closed after their retirement and was torn down to create an alleyway. I am assuming Spoiala also bought that property. In 1959, Spoiala got City Council approval to build a 12 feet 6 inches overpass connecting the Ritz on Riverside and Town House Hotel. In 1960 the Towne House Hotel caught fire. The fire department took an hour to get it under control. Zinberg at the time was still working at the hotel under a Riverview Hotel Company Lease owned by the Spoiala family. It looks like the overpass was never made but renovations were done by 1962 and a new sign was put up calling it the Ritz Hotel. The renovations included a new dining room, lounge, and overnight rooms. This was also the time that the word “new” seems to have been dropped.  This entrance would be the section that the gay bar would occupy in the 1970s. In 1962, it was advertised as a Businessmen's luncheon and there were bands and singers such as Steve Sampson's Blude Notes, Jim Travis Trio, and Bruce Johnson. Across the street from the Ritz's Pitt entrance was the Munro Hotel which also had rumours of being a Gay hangout, but I have no evidence to support this claim.", "George Spoiala died in 1964.  Trian Spoiala, his son, took over ownership. The Ritz on Pitt St. caught on fire again in 1968 and reopened with a “newly decorated Green Lounge.”", "In the early 1970s the Ritz was trying to find itself with various gimmicks such as a dance space with a Leprechaun Hop, “Bruce Johnson on the mighty Hammond Organ,” and in 1972 after its third fire and two years before it became a gay bar, the Ritz advertised that they had female topless Dancers. Between 1965 to 1974 Spoiala was listed for not paying $12, 521 in business taxes for the hotel. Al Katzman bought the place in the early 70s, possibly 1972 when they started having topless dancers.", "The straight owner, Al Katzman, was friends with Dick Casey (1935 - 2019). Katzman's son Robert remembers that Casey was the one who suggested that it rebrand itself as a gay bar. Casey was a gay man who operated many gay bars in Windsor for decades.", "From 1975 - 1981, the Ritz Hotel was the first official gay bar in Windsor. The building was torn down in 1987."], "image": "/photos/rh.png"}