{"id": "sl", "url": [{"path": "/photos/sl1.JPG", "type": "image", "imageAlt": "A street view of 737 Ouellette Avenue"}, {"path": "/photos/sl2.JPG", "type": "image", "imageAlt": "An empty indoor pool with the words “Shallow Area” printed around the lip"}, {"path": "/photos/sl3.JPG", "type": "image", "imageAlt": "A public bathroom and shower area with a sauna attached"}, {"path": "/photos/sl4.JPG", "type": "image", "imageAlt": "An empty apartment with cream walls, wooden flooring, and sliding door access to a balcony"}, {"path": "/photos/sl5.JPG", "type": "image", "imageAlt": "A kitchen & dining room with a large wooden dining table and chairs in the middle"}, {"path": "/photos/sl6.JPG", "type": "image", "imageAlt": "An apartment gym area fitted with treadmills, stationary bikes, and other various workout machines"}, {"path": "/photos/sl7.JPG", "type": "image", "imageAlt": "A small kitchen with white walls, cupboards, and appliances"}, {"path": "/photos/sl8.jpg", "type": "image", "imageAlt": "A street view of 737 Ouellette Avenue looking up at the apartment"}, {"path": "/photos/sl9.JPG", "type": "image", "imageAlt": "Another picture of the empty indoor pool showcasing its shallow and deep ends"}, {"path": "/photos/sl10.JPG", "type": "image", "imageAlt": "A spacious apartment laundry room with machines lining the walls and folding tables in the centre"}], "description": ["One of the first examples of the gay panic defense being used in Windsor was the killing of John Henderson, a Chrysler security guard, in 1975. Two young men, aged 18 and 20, were charged with the murder of Henderson in his apartment and leaving a knife stuck in his neck. The two young men first met Henderson when he picked them up in Cambridge, Ontario, when they were both hitchhiking. The three of them got along and Henderson dropped them off in London and asked them if they were ever in Windsor to look him up. They would take up his offer, showing up at his apartment to “crash” for the night. The next morning, Henderson bought them breakfast at Biff's. They toured the city that day and ended up going back to Henderson's apartment once more in the evening. Before they went to the apartment however, the two young men bought PCP, which they brought back.", "The whole defense of the case was that the 18-year-old was “temporarily insane” because he experienced “homosexual panic” when Henderson supposedly grabbed his crotch in the apartment. This is when the 18-year-old grabbed a bottle, hit him over the head, and then started to punch, kick, and stab him repeatedly, leaving the knife in his neck, and stealing a suitcase with his clothes and binoculars. Henderson was found by the police in his underwear and t-shirt on his bed. There were empty beer bottles all around the body. The psychiatrist Dr. Donald Nassr argued that the 18-year-old experienced “latent homosexual tendencies.” The 18-year-old talked about the “several homosexual advances made towards him” in the past. The jury was told that “if a person is a latent homosexual, he could react quite violently if touched by another man, regardless of if the act was expected or not”.", "Both young men were ultimately found guilty. The 18-year-old who stabbed Henderson was sentenced to life imprisonment, and the 20-year-old was found guilty of manslaughter and given 4 years. Two years later, an appeals court overturned the verdict because the “judge didn't tell the jury that drunkenness can produce a state of insanity.” The court cut a deal with the 18-year-old (now 20) and got 4 years for manslaughter."], "timeline": null, "image": "/photos/sl1.JPG"}