{"id": "uow", "url": [{"path": "/photos/uow1.png", "type": "image", "imageAlt": null}, {"path": "/photos/uow6.jpg", "type": "image", "altText": null}, {"path": "/photos/uow7.jpeg", "type": "image", "altText": null}, {"path": "/photos/uow8.jpg", "type": "image", "altText": null}, {"path": "/photos/uow9.jpg", "type": "image", "altText": null}, {"path": "/photos/uow10.jpg", "type": "image", "altText": null}], "description": "1972\n• Founding of the Windsor Homophile Association at the University of Windsor. Windsor’s first Gay Liberation group.\nFounders: Steve Lough and Jim Davies. Lough called a meeting at the University, which was attended by Lough, Davies and one other university student. Jim Monk was at the 2nd meeting, and Harold Desmarais joined soon afterward.\n1973\n• The Windsor Homophile Association change their name to Windsor Gay Unity.\n• Windsor has its first gay focused public event. “Gay Dance” at Alumni Lounge University of Windsor.\n• WGU decided to put an ad in the Windsor Star to get even more exposure to their already popular dances. The ad said “Gay Dance. Saturday 8:00 Pm Alumni Lounge U. of Windsor.” The ad was rejected. The editor at the time Mr. O’Callaghan said it “exploited sex and was in bad taste.” WGU decided to fight the discission and reported to the papers Press Council. O’Callaghan defended his position with many homophobic statements like, “We have no intention of lowering our standards on good taste.” The Press Council agreed that the Windsor Star discriminated against WGU. Windsor Star continued to refuse the ads even though they lost. This was not officially resolved until 1979.\n1977\n• Gay Students on Campus established at the University of Windsor and distributes literature to all faculty on “Helping Someone Gay.”\n1978\n• First gay focused radio show in Windsor. Closets R 4 Clothes, CJAM Radio Show. Monday evenings. Hosts: Jim Monk, Kevin Bishop, Mike/Bob Christmas, and Cathy Jamieson.\n1984\n•Gay Awareness Week: Iona College with public events on Gays and Religion, Human Rights for Homosexuals, A Healthy Approach to Gay Sex, and pornography and Gay Culture. The Gay sex event was the first education session on AIDS in Windsor. William Townsend from Detroit becomes the first person to speak publicly in Windsor about having AIDS.", "image": "/photos/uwo1.png"}