{"id": "uow", "url": [{"path": "/photos/uow1.png", "type": "image", "imageAlt": "8 members of the WGU posing for a photo"}, {"path": "/photos/uow2.jpg", "type": "image", "imageAlt": "A statue in a park of a hand holding a green apple with a bite taken out of it"}, {"path": "/photos/uow3.jpg", "type": "image", "imageAlt": "Street view of the sun setting through barren trees"}, {"path": "/photos/uow4.jpg", "type": "image", "imageAlt": "A view of the Ambassador Bridge from the promenade at dusk"}, {"path": "/photos/uow5.jpg", "type": "image", "imageAlt": "A wide shot of the riverside promenade statues at Assumption Park"},{"path": "/photos/uow6.jpg", "type": "image", "altText": "A large statue of an elephant with the Ambassador Bridge in the background"}, {"path": "/photos/uow7.jpeg", "type": "image", "altText": "A view from the promenade of a flock of birds flying over the Detroit River"}, {"path": "/photos/uow8.jpg", "type": "image", "altText": "A colourful statue of the silhouette of a flock of birds flying upwards with a sign in front that reads “Morning Light”"}, {"path": "/photos/uow9.jpg", "type": "image", "altText": "A man taking a picture of a memorial statue featuring a butterfly resting atop two outstretched stone hands"}, {"path": "/photos/uow10.jpg", "type": "image", "altText": "A large ornate church at the end of a long walkway"}, {"path": "/photos/uow11.png", "type": "image", "imageAlt": "A purple and rainbow logo for the UWSA Campus Pride Centre"}], "description": ["In 1972, the Windsor Homophile Association was founded here at the University of Windsor. They were Windsor's first gay liberation group. The founders were Steve Lough and Jim Davies. Lough called a meeting at the university, which was attended by Lough, Davies, and one other university student. Jim Monk was at the second meeting, and Harold Desmarais joined soon afterward.", "In 1973, the Windsor Homophile Association changed their name to Windsor Gay Unity and hosted Windsor's first gay-focused public event, a “Gay Dance” at the Alumni Lounge. At one point WGU decided to put an ad in the Windsor Star to get even more exposure to their already popular dances, but the ad was rejected. The editor at the time, Mr. O'Callaghan said it “exploited sex and was in bad taste.” The WGU decided to fight the decision and reported them to the Papers Press Council. O'Callaghan defended his position with homophobic statements such as “We have no intention of lowering our standards on good taste.” The Press Council ultimately agreed that the Windsor Star discriminated against the WGU. The Windsor Star continued to refuse the ads even though they lost, and this was not officially resolved until 1979.", "For decades, the queer community had to fight for their rights. Windsor's 2SLGBTQAI+ liberation groups were well respected around the province and country. For many years, Windsor hosted gay celebrations, including an annual Gay Awareness Week. Shortly after WGU was founded, the first Gay Awareness Week happened in Windsor from August 19 - 26, 1973.  Windsor celebrated by having a signature campaign to amend the Ontario Human Rights Code and a dance on August 25.", "In 1977, Gay Students on Campus was established at the University of Windsor and one of their first acts was to distribute literature to all faculty on “Helping Someone Gay.” Over the years, the campus group has had many name changes, with the current name being Campus Pride Centre.", "In 1978, the first gay-focused radio show in Windsor, titled “Closets R 4 Clothes“, began airing on the CJAM Radio Show on Monday evenings. The hosts were Jim Monk, Kevin Bishop, Mike/Bob Christmas, and Cathy Jamieson. Over the decades, CJAM has had various 2SLGBTQAI+ focused radio shows.", "In 1984, Windsor city council unanimously refused to declare Gay Awareness Week following a presentation by Dr. Robert McGirr and Dr. Walter Percival who claimed it would “display sexual activities in front of children” and “promote a way of life that spreads a lethal disease.”  The Gay Awareness Week was hosted at Iona College with public events on “Gays and Religion“, “Human Rights for Homosexuals“, “A Healthy Approach to Gay Sex“, and “Pornography and Gay Culture“. The gay sex event was the first education session on AIDS in Windsor. William Townsend from Detroit became the first person to speak publicly in Windsor about having AIDS."], "image": "/photos/uwo1.png"}