{"id": "uow", "url": [{"path": "/photos/uow1.png", "type": "image", "imageAlt": null}, {"path": "/photos/uow6.jpg", "type": "image", "altText": null}, {"path": "/photos/uow7.jpeg", "type": "image", "altText": null}, {"path": "/photos/uow8.jpg", "type": "image", "altText": null}, {"path": "/photos/uow9.jpg", "type": "image", "altText": null}, {"path": "/photos/uow10.jpg", "type": "image", "altText": null}], "description": "In 1972, the Windsor Homophile Association was founded here at the University of Windsor. They were Windsor's first Gay Liberation group. The founders were Steve Lough and Jim Davies. Lough called a meeting at the University, which was attended by Lough, Davies and one other university student. Jim Monk was at the second meeting, and Harold Desmarais joined soon afterward. In 1973, the Windsor Homophile Association changed their name to Windsor Gay Unity and hosted Windsor's first gay-focused public event, the “Gay Dance” at the Alumni Lounge in the University of Windsor. WGU decided to put an ad in the Windsor Star to get even more exposure to their already popular dances, but the ad was rejected. The editor at the time, Mr. O'Callaghan said it “exploited sex and was in bad taste.” The WGU decided to fight the decision and reported them to the Papers Press Council. O'Callaghan defended his position with homophobic statements such as “We have no intention of lowering our standards on good taste.” The Press Council ultimately agreed that the Windsor Star discriminated against the WGU. The Windsor Star continued to refuse the ads even though they lost, and this was not officially resolved until 1979. In 1977, Gay Students on Campus was established at the University of Windsor and distributed literature to all faculty on “Helping Someone Gay.” In 1978, the first gay-focused radio show in Windsor, titled “Closets R 4 Clothes“, began airing on the CJAM Radio Show on Monday evenings. The hosts were Jim Monk, Kevin Bishop, Mike/Bob Christmas, and Cathy Jamieson. 1984 marked the first Gay Awareness Week at Iona College with public events on “Gays and Religion“, “Human Rights for Homosexuals“, “A Healthy Approach to Gay Sex“, and “Pornography and Gay Culture“. The Gay Sex event was the first education session on AIDS in Windsor. William Townsend from Detroit became the first person to speak publicly in Windsor about having AIDS.", "image": "/photos/uwo1.png"}