{"id": "wa", "url": [{"path": "/photos/wa1.png", "type": "image", "imageAlt": "View of the AIDS quilt 1992"}, {"path": "/photos/wa2.png", "type": "image", "imageAlt": "A stained glass window with a rose in the centre reads “Aids Committee of Windsor” and is covered in signatures"}, {"path": "/photos/wa3.png", "type": "image", "imageAlt": "A large yellow cloth with small handwritten paragraphs on it is draped over a large oval meeting desk surrounded by office chairs"}, {"path": "/photos/wa4.jpg", "type": "image", "imageAlt": "A street view of the Windsor Armouries building"}, {"path": "/photos/wa5.jpg", "type": "image", "imageAlt": "Two students sit on a stand in the middle of an empty painting class texting"}, {"path": "/photos/wa6.jpg", "type": "image", "imageAlt": "An inside view of the entrance to the Windsor Armouries showcasing large wooden sliding doors, exposed brick walls, and arched windows"}, {"path": "/photos/wa7.jpg", "type": "image", "imageAlt": "A view of the hallways, classroom doors, and sitting areas inside of the armouries"}, {"path": "/photos/wa8.jpg", "type": "image", "imageAlt": "A crowd is formed as a person wearing a white top hat and white outfit with clear balloons attached stands in a spotlight"}, {"path": "/photos/wa9.jpg", "type": "image", "imageAlt": "An empty painting studio with easels and rolling carts scattered around the room"}, {"path": "/photos/wa10.jpg", "type": "image", "imageAlt": "An empty classroom with desks and chairs arranged in a semi-circle facing a long whiteboard on the far wall"}], "description": ["In 1924, Red Allan was the first recorded example of a local female impersonator, performing in the play “Hokum” at Walkerville Theatre, as well as at the Windsor Armouries. It included blackface.", "1992 the AIDS Quilt came to Windsor and was displayed at the Windsor Armoury as part of the Festival of Life. It was co-sponsored by the ACE and Gina Lori Riley Dance enterprise.  The founder of the Dance troupe performed at the Capital theatre and then had a revealing of the locally produced panels. Steve Lough was the executive director of ACW at the time and his response to the display “recognize the losses to the artistic community to AIDS, the quilt goes beyond that, acknowledges all the people who have died, and the artistry in many people's lives who weren't artists.” Lough also stated that “at the same time, there is a ray of hope in the project, too. It's to remember their lives, not their deaths”."], "timeline": null, "image": "/photos/wa1.png"}