{"id": "wct", "url": [{"path": "/photos/wct1.jpg", "type": "image", "imageAlt": "A front-row view of an orchestra playing at the Windsor Capitol Theatre"}, {"path": "/photos/wct2.jpg", "type": "image", "imageAlt": "A balcony view of a conductor and orchestra standing for an ovation at the Windsor Capitol Theatre"}, {"path": "/photos/wct3.jpg", "type": "image", "imageAlt": "A street view of the ornate outside of the Windsor Capitol Theatre lit by poster boxes on a rainy night"}, {"path": "/photos/wct4.jpg", "type": "image", "imageAlt": "A lit chandelier hangs in the lobby of the Windsor Capitol Theatre showcasing ornate gold, green, and red ceiling and wall details"}, {"path": "/photos/wct5.jpg", "type": "image", "imageAlt": "A nine piece band consisting of a singer, saxophone player, violinist, bassist, two keyboard players, and two guitarists play on the Windsor Capitol Theatre stage"}, {"path": "/photos/wct6.jpg", "type": "image", "imageAlt": "A vintage gold chandelier hangs from an ornate red and green base with gold moulding from the ceiling of the lobby"}, {"path": "/photos/wct7.jpg", "type": "image", "imageAlt": "A large cast of ballet dancers are gathered on stage to pose for a photo"}, {"path": "/photos/wct8.jpg", "type": "image", "imageAlt": "A person is stood on a balcony overlooking the Detroit River and the surrounding buildings lit up at night"}, {"path": "/photos/wct9.jpg", "type": "image", "imageAlt": "A view of the moulding and artwork on the ceiling and walls of the Windsor Capitol Theatre"}, {"path": "/photos/wct10.jpg", "type": "image", "imageAlt": "A street view of the ornate outside of the Windsor Capitol Theatre"}, {"path": "/photos/wct11.jpeg", "type": "image", "imageAlt": "A retro-futuristic poster for House of Venus with a ufo illustration on it"}], "description": ["In 1923, the Dumbells performed their shows “Cheerio” and “Carry On”. In 1928, the nationally known female impersonator Ross Hamilton, originally part of the Dumbells, performed, and in 1927 and 1929, Mike (Lionel) Ames, a female impersonator from Ann Arbor by the name of “Miss Fluffy Ruffles” also performed.", "House of Venus was founded by Michael Venus, Greg George, Edward Abbey, and David Newman. Venus was formed with the intention of bringing positive energy through art and creativity. The collective achieved this by producing theme parties, performance and visual art and working in different media and mediums in Windsor and Detroit. They started creating wearable art and producing fashion shows on both sides of the border which then birthed their annual fundraiser Wiggle. They felt a need to give space for the Queer and artistic communities and with their DIY mentality that is exactly what they did during an era where being LGBTQ+ was not accepted. The Venus kids were known for their gender bending ways and activism through art in the early 90s before heading to Vancouver in 1995. They still exist in Montreal. House of Venus also had a clothing store in this area in the 1990s.", "In 1990, Patricia Wilson became the first out trans woman Executive Director of Windsor Arts Council. She left Windsor for Toronto in 1992 after some questionable (possibly transphobic) issues at the WAC. During her time here, she was “instrumental in saving the historic Capital Theatre.”"], "image": "/photos/wct1.jpg"}